[
    {
        "BookCode":  "MAL",
        "SurahNumber":  "31",
        "AyahNumber":  "1",
        "Recitation":  "Alafasy_128kbps/031001",
        "Body":  "Alif Lam M\u0027im."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "31",
        "AyahNumber":  "10",
        "Recitation":  "Alafasy_128kbps/031010",
        "Body":  "He created the heavens without visible pillars; He set mountains\n\t\t\ton the earth lest it convulse with you; and scattered through it\n\t\t\tall kinds of animals. We send down rain from the sky with which\n\t\t\tWe grow every type of noble species in pairs."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "31",
        "AyahNumber":  "11",
        "Recitation":  "Alafasy_128kbps/031011",
        "Body":  "This is Allah\u0027s creation; now, show Me what is there that others\n\t\t\t(gods) besides Him have created? - In fact the wrongdoers are in\n\t\t\tmanifest error."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "31",
        "AyahNumber":  "12",
        "Recitation":  "Alafasy_128kbps/031012",
        "Body":  "We gave wisdom to Luqman so that he may be grateful to Allah. The\n\t\t\tone who pay thanks, does so for his own good; and the one who\n\t\t\tdenies His favors, should know that Allah is certainly free of\n\t\t\tall wants, worthy of all praise."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "31",
        "AyahNumber":  "13",
        "Recitation":  "Alafasy_128kbps/031013",
        "Body":  "When Luqman, while advising his son, said to him: \"O my son! Do\n\t\t\tnot ever commit shirk (associating anyone else with Allah);\n\t\t\tsurely committing shirk is the worst iniquity.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "31",
        "AyahNumber":  "14",
        "Recitation":  "Alafasy_128kbps/031014",
        "Body":  "We have enjoined man concerning his parents - his mother carries\n\t\t\thim in her womb while suffering weakness upon weakness and then\n\t\t\tweans him for two years - That\u0027s why We commanded him: \"Give\n\t\t\tthanks to Me and to your parents, and keep in mind that, to Me is\n\t\t\tyour final goal."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "31",
        "AyahNumber":  "15",
        "Recitation":  "Alafasy_128kbps/031015",
        "Body":  "If they argue with you to commit shirk, of which you have no\n\t\t\tknowledge, then do not obey them; however you should still treat\n\t\t\tthem kindly in this world, but follow the way of that individual\n\t\t\twho has turned to Me. After all, to Me is your return; then I\n\t\t\twill inform you about the reality of all that you have done.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "31",
        "AyahNumber":  "16",
        "Recitation":  "Alafasy_128kbps/031016",
        "Body":  "Luqman further said: \"O my son! Allah will bring all things to\n\t\t\tlight, be they as small as a grain of a mustard seed, be they\n\t\t\thidden inside a rock or high above in the heavens or deep down in\n\t\t\tthe earth. Allah is well aware of all things to their finest\n\t\t\tdetails."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "31",
        "AyahNumber":  "17",
        "Recitation":  "Alafasy_128kbps/031017",
        "Body":  "O my son! Establish Salah, enjoin good and forbid the evil.\n\t\t\tEndure with patience whatever befalls you, surely this shows your\n\t\t\tdetermination in conducting the affairs."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "31",
        "AyahNumber":  "18",
        "Recitation":  "Alafasy_128kbps/031018",
        "Body":  "Do not speak to the people with your face turned away, nor walk\n\t\t\tproudly on earth; for Allah does not love any self-conceited\n\t\t\tboaster."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "31",
        "AyahNumber":  "19",
        "Recitation":  "Alafasy_128kbps/031019",
        "Body":  "Be moderate in your pace and lower your voice; for the harshest\n\t\t\tof voices is the braying of a donkey.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "31",
        "AyahNumber":  "2",
        "Recitation":  "Alafasy_128kbps/031002",
        "Body":  "These are verses of the Book of wisdom,"
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "31",
        "AyahNumber":  "20",
        "Recitation":  "Alafasy_128kbps/031020",
        "Body":  "Do you not see that Allah has subjected to your benefit all that\n\t\t\tis in the heavens and in the earth, and has lavished on you His\n\t\t\tevident and hidden favors? Yet there are some people who still\n\t\t\targue about Allah without knowledge, without guidance or an\n\t\t\tenlightening Book."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "31",
        "AyahNumber":  "21",
        "Recitation":  "Alafasy_128kbps/031021",
        "Body":  "When they are asked to follow what Allah has revealed, they\n\t\t\treply: \"Nay, we shall follow the ways upon which we found our\n\t\t\tforefathers\". What! Will they still follow them even though\n\t\t\tShaitan invites them to the punishment of the blazing fire."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "31",
        "AyahNumber":  "22",
        "Recitation":  "Alafasy_128kbps/031022",
        "Body":  "He who surrenders himself to Allah and leads a righteous life has\n\t\t\tindeed grasped the most trustworthy hand-hold; as the ultimate\n\t\t\tdisposal of affairs rests with Allah."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "31",
        "AyahNumber":  "23",
        "Recitation":  "Alafasy_128kbps/031023",
        "Body":  "As for he who disbelieves, let not his disbelief grieve you. To\n\t\t\tUs is their return and We shall inform them the reality of their\n\t\t\tdeeds; surely Allah knows the secrets of the breasts."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "31",
        "AyahNumber":  "24",
        "Recitation":  "Alafasy_128kbps/031024",
        "Body":  "We let them enjoy for a while this life, then in the hereafter We\n\t\t\tshall drive them to an unrelenting punishment."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "31",
        "AyahNumber":  "25",
        "Recitation":  "Alafasy_128kbps/031025",
        "Body":  "If you ask them: \"Who has created the heavens and the earth?\"\n\t\t\tThey will certainly say: \"Allah\". Say: \"Praise be to Allah!\" But\n\t\t\tthe fact is that most of them do not use their common sense to\n\t\t\tunderstand."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "31",
        "AyahNumber":  "26",
        "Recitation":  "Alafasy_128kbps/031026",
        "Body":  "To Allah belong all that is in the heavens and earth; surely\n\t\t\tAllah is the One Who is free of all wants, worthy of all praise."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "31",
        "AyahNumber":  "27",
        "Recitation":  "Alafasy_128kbps/031027",
        "Body":  "If all the trees on earth were pens, and the ocean were ink,\n\t\t\treplenished by seven more oceans, the writing of Allah\u0027s Words\n\t\t\t(His wonderful signs and creations) would not be exhausted;\n\t\t\tsurely Allah is Mighty Wise."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "31",
        "AyahNumber":  "28",
        "Recitation":  "Alafasy_128kbps/031028",
        "Body":  "Neither your creation nor your resurrection is anything but as\n\t\t\tsimple as the creation and resurrection of a single soul; surely\n\t\t\tAllah is All-Hearing, All-Seeing."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "31",
        "AyahNumber":  "29",
        "Recitation":  "Alafasy_128kbps/031029",
        "Body":  "Do you not see that Allah causes the night to pass into the day\n\t\t\tand the day into the night, that He has subjected the sun and the\n\t\t\tmoon to follow His law, each pursuing its course for an appointed\n\t\t\tterm, and that Allah is well aware of all your actions?"
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "31",
        "AyahNumber":  "3",
        "Recitation":  "Alafasy_128kbps/031003",
        "Body":  "a guide and a blessing for the righteous:"
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "31",
        "AyahNumber":  "30",
        "Recitation":  "Alafasy_128kbps/031030",
        "Body":  "This is because Allah is the only Reality and because all those\n\t\t\tto whom the people invoke besides Him, are false, and because\n\t\t\tAllah is the One Who is the Most High, the Great."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "31",
        "AyahNumber":  "31",
        "Recitation":  "Alafasy_128kbps/031031",
        "Body":  "Do you not see how the ships sail through the ocean by the grace\n\t\t\tof Allah so that He may show you some of His signs? Surely there\n\t\t\tare signs in this for every patient, thankful person."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "31",
        "AyahNumber":  "32",
        "Recitation":  "Alafasy_128kbps/031032",
        "Body":  "When any giant wave covers them like a canopy, they pray to Allah\n\t\t\twith all devotion making their faith pure for Him. But when He\n\t\t\tdelivers them safely to land, some of them falter between belief\n\t\t\tand unbelief. None reject Our revelations except the treacherous\n\t\t\tand the ungrateful."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "31",
        "AyahNumber":  "33",
        "Recitation":  "Alafasy_128kbps/031033",
        "Body":  "O mankind! Have fear of your Rabb and fear that Day when no\n\t\t\tfather shall avail his son nor a son his father. Surely the\n\t\t\tpromise of Allah is true. Let not the life of this world deceive\n\t\t\tyou, nor let the Deceiver (Shaitan) deceive you concerning Allah."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "31",
        "AyahNumber":  "34",
        "Recitation":  "Alafasy_128kbps/031034",
        "Body":  "Surely Allah Alone has the knowledge of the Hour, He is the One\n\t\t\tWho sends down the rain and He knows what is in the wombs. No one\n\t\t\tknows what he will earn the next day; and no one knows in what\n\t\t\tland he will die. Surely, Allah knows all this and is aware of\n\t\t\teverything."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "31",
        "AyahNumber":  "4",
        "Recitation":  "Alafasy_128kbps/031004",
        "Body":  "who establish Salah (Islamic Prayers), give Zakah (obligatory\n\t\t\tCharity) and firmly believe in the hereafter."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "31",
        "AyahNumber":  "5",
        "Recitation":  "Alafasy_128kbps/031005",
        "Body":  "These are on true guidance from their Rabb and these are the ones\n\t\t\twho will attain felicity."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "31",
        "AyahNumber":  "6",
        "Recitation":  "Alafasy_128kbps/031006",
        "Body":  "Among the people there are some who purchase frivolous tales so\n\t\t\tthat they may lead people away from the Way of Allah, without any\n\t\t\tknowledge, and take the invitation to the Right Way as a mockery.\n\t\t\tFor such people there will be a humiliating punishment."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "31",
        "AyahNumber":  "7",
        "Recitation":  "Alafasy_128kbps/031007",
        "Body":  "When Our revelations are recited to such a person, he turns his\n\t\t\tface away in arrogance as if he did not hear them or as if his\n\t\t\tears are sealed: announce to him the news of a painful\n\t\t\tpunishment."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "31",
        "AyahNumber":  "8",
        "Recitation":  "Alafasy_128kbps/031008",
        "Body":  "As for those who believe and do good deeds, there will be gardens\n\t\t\tof delight,"
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "31",
        "AyahNumber":  "9",
        "Recitation":  "Alafasy_128kbps/031009",
        "Body":  "wherein they shall live forever. The promise of Allah is true: He\n\t\t\tis the Almighty, the Wise."
    }
]
