[
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "1",
        "Recitation":  "Alafasy_128kbps/009001",
        "Body":  "A declaration of immunity from Allah and His Rasool is hereby\n\t\t\tmade to those of the mushrikin with whom you have made a treaty:"
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "10",
        "Recitation":  "Alafasy_128kbps/009010",
        "Body":  "They neither honor the ties of relationship nor observe the\n\t\t\tobligations of treaties with the believers; it is they who are\n\t\t\tthe transgressors."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "100",
        "Recitation":  "Alafasy_128kbps/009100",
        "Body":  "As for the first pioneers who accepted Islam from the Muhajir\n\t\t\t(immigrants) and Ansar (supporters in Madinah) and those who\n\t\t\tfollow them in good deeds, Allah is well pleased with them and\n\t\t\tthey are pleased with Him. He has prepared for them gardens\n\t\t\tbeneath which rivers flow, wherein they shall live forever: that\n\t\t\tis the mighty achievement."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "101",
        "Recitation":  "Alafasy_128kbps/009101",
        "Body":  "Some of the desert Arabs around you are hypocrites, and so are\n\t\t\tsome of the residents of Madinah, who are fanatical in their\n\t\t\thypocrisy. You do not know them, but We know them. Soon We shall\n\t\t\tgive them double punishment: then they shall be turned to the\n\t\t\tmost severe chastisement."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "102",
        "Recitation":  "Alafasy_128kbps/009102",
        "Body":  "There are some who have confessed their sins: they have mixed\n\t\t\trecords of good and bad deeds. It is quite possible that Allah\n\t\t\tmay turn to them in mercy, for Allah is Forgiving, Merciful."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "103",
        "Recitation":  "Alafasy_128kbps/009103",
        "Body":  "Take sadaqat (this commanded sadaqat means - Zakat-ul-Mall) from\n\t\t\ttheir wealth, so that they may thereby be cleansed and purified,\n\t\t\tand pray for them; for your prayer will give them comfort. Allah\n\t\t\thears all and knows all."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "104",
        "Recitation":  "Alafasy_128kbps/009104",
        "Body":  "Do they not know that Allah accepts repentance from His servants\n\t\t\tand takes their sadaqat (charity), and surely Allah is the One\n\t\t\tWho is the Accepter of Repentance, the Merciful?"
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "105",
        "Recitation":  "Alafasy_128kbps/009105",
        "Body":  "Tell them: \"Do as you will. Allah, His Rasool and the believers\n\t\t\twill now keep a watch over your conduct; then you shall be\n\t\t\tbrought to His court Who knows the hidden and the open, and He\n\t\t\twill inform you of all that you have done.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "106",
        "Recitation":  "Alafasy_128kbps/009106",
        "Body":  "There are yet others whose case is held in suspense for the\n\t\t\tdecision of Allah. He will either punish them or turn to them in\n\t\t\tmercy; and Allah is Knowledgeable, Wise."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "107",
        "Recitation":  "Alafasy_128kbps/009107",
        "Body":  "There are others who built a Masjid for mischievous motives\n\t\t\t(Masjid-e-Zirar), to spread disbelief and to disunite the\n\t\t\tbelievers, and an outpost for one (Abu \u0027Amir) who had made war\n\t\t\tagainst Allah and His Rasool before. They will indeed swear that\n\t\t\ttheir intentions are nothing but good; but Allah declares that\n\t\t\tthey are absolute liars."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "108",
        "Recitation":  "Alafasy_128kbps/009108",
        "Body":  "You should never stand to offer Salah in it. Certainly the Masjid\n\t\t\tfounded on piety from the very first day is more deserving that\n\t\t\tyou should stand to offer Salah in it; for in it there are men\n\t\t\twho love to be purified; and Allah loves those who purify\n\t\t\tthemselves."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "109",
        "Recitation":  "Alafasy_128kbps/009109",
        "Body":  "Who is a better person; he who lays the foundation of his\n\t\t\tbuilding on piety to Allah and His good pleasure, or he who lays\n\t\t\tthe foundation of his building on an undermined bank that will\n\t\t\ttumble down with him into the fire of Hell? Allah does not guide\n\t\t\tsuch wrongdoers."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "11",
        "Recitation":  "Alafasy_128kbps/009011",
        "Body":  "However, if they repent, establish Salah and pay Zakah, then they\n\t\t\tshall be your brethren in Deen (faith and way of life based on\n\t\t\tDivine guidance): thus do We spell out Our revelations for people\n\t\t\tof understanding."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "110",
        "Recitation":  "Alafasy_128kbps/009110",
        "Body":  "The foundation of those who so build is never free from suspicion\n\t\t\tand shakiness in their hearts until their hearts are cut to\n\t\t\tpieces. Allah is Knowledgeable, Wise."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "111",
        "Recitation":  "Alafasy_128kbps/009111",
        "Body":  "Indeed Allah has purchased from the believers their persons and\n\t\t\ttheir wealth and in return has promised them paradise; they fight\n\t\t\tin the cause of Allah and slay and are slain. This is a true\n\t\t\tpromise which is binding on Him mentioned in Taurat (Torah), the\n\t\t\tInjeel (Gospel) and the Qur\u0027an; and who is more true in\n\t\t\tfulfilling his promise than Allah? Rejoice, therefore, in the\n\t\t\tbargain which you have made, and that is a mighty achievement."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "112",
        "Recitation":  "Alafasy_128kbps/009112",
        "Body":  "Those that turn to Allah in repentance, serve Him, praise Him,\n\t\t\tmove about in the land for His sake, make Rakuh (bow down in\n\t\t\tprayer) and Sajud (prostrate themselves in prayer), enjoin what\n\t\t\tis good and forbid what is evil, and observe the limits\n\t\t\t(permissions and prohibitions) set by Allah (they are the ones\n\t\t\twho make such a bargain with Allah). O Prophet, proclaim the good\n\t\t\tnews to such believers."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "113",
        "Recitation":  "Alafasy_128kbps/009113",
        "Body":  "It is not proper for the Prophet and those who believe that they\n\t\t\tshould beg forgiveness for the mushrikin, even though they be\n\t\t\ttheir relatives, after it has been explained to them that they\n\t\t\tare the inmates of hellfire."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "114",
        "Recitation":  "Alafasy_128kbps/009114",
        "Body":  "Ibrahim (Abraham) prayed for his father\u0027s forgiveness only to\n\t\t\tfulfill a promise he had made to him. But when it became clear to\n\t\t\thim that he was an enemy of Allah he disassociated himself from\n\t\t\thim. The fact is that Ibrahim was tenderhearted, forbearing."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "115",
        "Recitation":  "Alafasy_128kbps/009115",
        "Body":  "It is not the way of Allah to confound people after He has guided\n\t\t\tthem, until He makes clear to them what they should guard\n\t\t\tagainst; surely Allah has the knowledge of everything."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "116",
        "Recitation":  "Alafasy_128kbps/009116",
        "Body":  "Surely it is Allah to Whom belongs the kingdom of the heavens and\n\t\t\tthe earth. He gives life and causes to die. You have none besides\n\t\t\tAllah to protect or to help."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "117",
        "Recitation":  "Alafasy_128kbps/009117",
        "Body":  "Allah forgave the Prophet and those Muhajir and the Ansar who\n\t\t\tstood by him in the time of distress, when some were on the point\n\t\t\tof losing heart. He turned to them in mercy. Surely to them He is\n\t\t\tMost Kind, Most Merciful."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "118",
        "Recitation":  "Alafasy_128kbps/009118",
        "Body":  "He also turned in mercy to the three, the decision of whose case\n\t\t\twas deferred. So despondent were they that the earth, with all\n\t\t\tits vastness, and their own souls, seemed to close in upon them.\n\t\t\tThey knew for certain that there was no refuge from Allah except\n\t\t\tin Him. Then He turned to them in mercy so that they could\n\t\t\trepent. Surely Allah is the One Who is Oft-Returning, the\n\t\t\tMerciful."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "119",
        "Recitation":  "Alafasy_128kbps/009119",
        "Body":  "O believers! Have fear of Allah and be with those who are\n\t\t\ttruthful in word and deed."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "12",
        "Recitation":  "Alafasy_128kbps/009012",
        "Body":  "But if they violate their treaty once they have sworn it and\n\t\t\tinsult your Deen, then fight with the ringleaders of the unbelief\n\t\t\t- for their oaths are nothing to them - so that they may be\n\t\t\tstopped."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "120",
        "Recitation":  "Alafasy_128kbps/009120",
        "Body":  "It is not proper for the people of Madinah and the beduin Arabs\n\t\t\tof the neighborhood to forsake the Rasool of Allah or to\n\t\t\tjeopardize his life so as to safeguard their own: because they do\n\t\t\tnot suffer any thirst or hunger or any ordeal for the sake of\n\t\t\tAllah, or take any step which may provoke the unbelievers, or\n\t\t\treceive any injury from an enemy, but shall be written down as a\n\t\t\tgood deed to their account; for Allah does not waste the reward\n\t\t\tof the righteous."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "121",
        "Recitation":  "Alafasy_128kbps/009121",
        "Body":  "Likewise, they do not spend anything for the cause of Allah, be\n\t\t\tit small or large, or cut across a valley in Jihad, but is\n\t\t\twritten down to their credit; so that Allah may reward them based\n\t\t\ton the best of their deeds."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "122",
        "Recitation":  "Alafasy_128kbps/009122",
        "Body":  "It is not proper that the believers should go forth all together.\n\t\t\tTherefore, why not a squadron from each division stay behind so\n\t\t\tthat they may obtain the understanding of Deen (Al-Islam), and\n\t\t\tadmonish the people when they return to them so that they may\n\t\t\trefrain from un-Islamic conduct!"
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "123",
        "Recitation":  "Alafasy_128kbps/009123",
        "Body":  "O believers! Fight the unbelievers who hem you in, to let them\n\t\t\tknow how tough you are; you should know that Allah is on the side\n\t\t\tof the Godfearing."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "124",
        "Recitation":  "Alafasy_128kbps/009124",
        "Body":  "Whenever a Surah is revealed, some of them ask: \"Whose faith from\n\t\t\tamong you has increased by this?\" Certainly the faith of the\n\t\t\tbelievers is increased and they do rejoice."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "125",
        "Recitation":  "Alafasy_128kbps/009125",
        "Body":  "As for those whose hearts contain malice, it will add filth to\n\t\t\ttheir existing filth, and they will die while they are still\n\t\t\tdisbelievers."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "126",
        "Recitation":  "Alafasy_128kbps/009126",
        "Body":  "Do they not see that they are tested every year once or twice?\n\t\t\tYet they neither repent nor learn a lesson from this."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "127",
        "Recitation":  "Alafasy_128kbps/009127",
        "Body":  "Whenever a Surah is revealed they look at each other as if to\n\t\t\task, \"Is anyone watching?\" Then they silently slip away. Allah\n\t\t\thas slipped their hearts (from the guidance), for they are a\n\t\t\tpeople who do not want to understand."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "128",
        "Recitation":  "Alafasy_128kbps/009128",
        "Body":  "Now, there has come to you a Rasool from among yourselves, the\n\t\t\tone who grieves at your loss and who is excessively anxious for\n\t\t\tyour success in both worlds, and who is compassionate and\n\t\t\tmerciful towards the believers."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "129",
        "Recitation":  "Alafasy_128kbps/009129",
        "Body":  "Now, if they turn away from you, (O Prophet) say: \"Allah is\n\t\t\tall-sufficient for me. There is no god but Him. In Him I have\n\t\t\tput my trust. He is the Rabb of the Mighty Throne.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "13",
        "Recitation":  "Alafasy_128kbps/009013",
        "Body":  "Will you not fight against those people who have broken their\n\t\t\toaths, conspired to expel the Rasool and were the first to attack\n\t\t\tyou? Do you fear them? Nay, it is Allah Who is more deserving of\n\t\t\tyour fear, if you are true believers."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "14",
        "Recitation":  "Alafasy_128kbps/009014",
        "Body":  "Fight them; Allah will punish them by your hands and humiliate\n\t\t\tthem. He will grant you victory over them and soothe the hearts\n\t\t\tof a believing people."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "15",
        "Recitation":  "Alafasy_128kbps/009015",
        "Body":  "He will take away all rancor from their hearts. Allah shows mercy\n\t\t\tto whom He pleases, and Allah is All-Knowledgeable, All-Wise."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "16",
        "Recitation":  "Alafasy_128kbps/009016",
        "Body":  "Do you think that you will be left alone (without trial)? While\n\t\t\tAllah has not yet demonstrated which of you had exerted your\n\t\t\tutmost struggle (in the path of Allah) and did not take any\n\t\t\tintimate friends other than Allah, His Rasool and the believers?\n\t\t\tAllah is well aware of all your actions."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "17",
        "Recitation":  "Alafasy_128kbps/009017",
        "Body":  "It is not for the mushrikin to maintain the mosques of Allah\n\t\t\twhile they bear witness against themselves about their unbelief.\n\t\t\tIt is they whose deeds are in vain and in the hellfire shall they\n\t\t\tlive forever."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "18",
        "Recitation":  "Alafasy_128kbps/009018",
        "Body":  "The mosques of Allah should be maintained by those who believe in\n\t\t\tAllah and the Last Day, establish Salah (prayers), and pay Zakah\n\t\t\t(poor due) and fear none except Allah. It is they who are\n\t\t\texpected to follow the true guidance."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "19",
        "Recitation":  "Alafasy_128kbps/009019",
        "Body":  "Have you made those who provide water to the pilgrims and\n\t\t\tmaintain the Masjid-al-Haram equal to those who believe in Allah,\n\t\t\tthe Last Day and make Jihad (striving in the cause of Allah)?\n\t\t\tThey are not equal in the sight of Allah, and Allah does not\n\t\t\tguide the wrongdoers."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "2",
        "Recitation":  "Alafasy_128kbps/009002",
        "Body":  "\"You have four months to go around in the land unmolested; but\n\t\t\tyou should know that you cannot frustrate the will of Allah, and\n\t\t\tthat Allah will humiliate the unbelievers.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "20",
        "Recitation":  "Alafasy_128kbps/009020",
        "Body":  "Those who believe (embrace Islam), leave their homes (migrate),\n\t\t\tand make Jihad with their wealth and persons in the cause of\n\t\t\tAllah, have higher rank in the sight of Allah. It is they who\n\t\t\twill be truly successful."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "21",
        "Recitation":  "Alafasy_128kbps/009021",
        "Body":  "Their Rabb gives them good news of His mercy, His good pleasure,\n\t\t\tand paradise with everlasting bliss."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "22",
        "Recitation":  "Alafasy_128kbps/009022",
        "Body":  "They will live therein forever. Surely it is Allah with Whom is\n\t\t\tthe mighty reward."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "23",
        "Recitation":  "Alafasy_128kbps/009023",
        "Body":  "O believers! Do not take your fathers and your brothers as your\n\t\t\tfriends if they prefer Kufr (unbelief) over Iman (belief); for\n\t\t\tthose who turn away from this commandment shall be considered\n\t\t\twrongdoers."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "24",
        "Recitation":  "Alafasy_128kbps/009024",
        "Body":  "O Prophet, tell them: If your fathers, your sons, your brothers,\n\t\t\tyour spouses, your relatives, the wealth that you have acquired,\n\t\t\tthe business in which you fear a loss, and the homes which you\n\t\t\tlike are dearer to you than Allah, His Rasool, and making Jihad\n\t\t\t(struggle) in His Way, then wait until Allah brings about His\n\t\t\tdecision. Allah does not guide the transgressors."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "25",
        "Recitation":  "Alafasy_128kbps/009025",
        "Body":  "Allah has indeed helped you in many battlefields and (recently)\n\t\t\ton the day of Hunain: when you were proud of your great numbers\n\t\t\t(the Muslim army was 12,000 strong and the unbelievers were only\n\t\t\t4,000), but the numbers availed you nothing. The earth, with all\n\t\t\tits vastness, seemed to close in upon you, and you turned your\n\t\t\tbacks and fled."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "26",
        "Recitation":  "Alafasy_128kbps/009026",
        "Body":  "But Allah sent down His sakeenah (peace and tranquility) upon His\n\t\t\tRasool and the believers and sent down to your aid those forces\n\t\t\twhich you could not see, and punished the unbelievers. Thus was\n\t\t\tthe recompense for the unbelievers."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "27",
        "Recitation":  "Alafasy_128kbps/009027",
        "Body":  "Then after that, you also witnessed that Allah guided to repent\n\t\t\tsome of them whom He wanted, for Allah is Forgiving, Merciful."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "28",
        "Recitation":  "Alafasy_128kbps/009028",
        "Body":  "O believers! Know that mushrikin are unclean; therefore, do not\n\t\t\tlet them come near the Masjid-al-Haram after this year\u0027s\n\t\t\tpilgrimage. If you fear poverty, soon Allah - if He so wills -\n\t\t\tenrich you out of His bounty. Allah is All-Knowledgeable,\n\t\t\tAll-Wise."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "29",
        "Recitation":  "Alafasy_128kbps/009029",
        "Body":  "Fight those people of the Book (Jews and Christians) who do not\n\t\t\tbelieve in Allah and the Last Day, do not refrain from what has\n\t\t\tbeen prohibited by Allah and His Rasool and do not embrace the\n\t\t\treligion of truth (Al-Islam), until they pay Jizya (protection\n\t\t\ttax) with their own hands and feel themselves subdued."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "3",
        "Recitation":  "Alafasy_128kbps/009003",
        "Body":  "This is a public proclamation from Allah and His Rasool to the\n\t\t\tpeople on the day of the Great Hajj (Pilgrimage) that Allah and\n\t\t\tHis Rasool do hereby dissolve treaty obligations with the\n\t\t\tmushrikin. Therefore, if you repent, it will be better for you\n\t\t\tbut if you turn away, then you should know that you cannot\n\t\t\tfrustrate the Will of Allah. O Prophet, proclaim a painful\n\t\t\tpunishment to those who are unbelievers."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "30",
        "Recitation":  "Alafasy_128kbps/009030",
        "Body":  "The Jews say: \"Uzair (Azra) is the son of Allah,\" and the\n\t\t\tChristians say: \" Messiah (Christ) is the son of Allah.\" That is\n\t\t\twhat they say with their mouths, imitating the sayings of the\n\t\t\tformer unbelievers. May Allah destroy them! How perverted they\n\t\t\tare!"
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "31",
        "Recitation":  "Alafasy_128kbps/009031",
        "Body":  "They (Jews and Christians) have taken their rabbis and priests to\n\t\t\tbe their Lords beside Allah and so they did with Messiah (Jesus)\n\t\t\tthe son of Maryam (Mary), although they were commanded in the\n\t\t\tTorah and the Gospel to worship none but One Ilah (Allah);\n\t\t\tbesides Whom there is none worthy of worship. Exalted be He above\n\t\t\tthose whom they associate with Him."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "32",
        "Recitation":  "Alafasy_128kbps/009032",
        "Body":  "They desire to extinguish the light of Allah with their mouths\n\t\t\tbut Allah will not allow it to happen, for He seeks to perfect\n\t\t\tHis light even though the disbelievers may dislike it."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "33",
        "Recitation":  "Alafasy_128kbps/009033",
        "Body":  "It is He Who has sent His Rasool with guidance and true Deen\n\t\t\t(faith) to make it prevail over all other deens (faiths) even\n\t\t\tthough the mushrikin may hate it."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "34",
        "Recitation":  "Alafasy_128kbps/009034",
        "Body":  "O believers! Indeed most of the (Jewish) rabbis and (Christian)\n\t\t\tpriests misappropriate the wealth of people and hinder them from\n\t\t\tthe way of Allah. To those who hoard gold and silver and do not\n\t\t\tspend it in the way of Allah, proclaim a painful punishment."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "35",
        "Recitation":  "Alafasy_128kbps/009035",
        "Body":  "The Day will surely come when their treasure will be heated up in\n\t\t\tthe fire of hell, and their foreheads, sides and backs branded\n\t\t\twith it. They will be told: \"This is the treasure which you\n\t\t\thoarded. Now taste what you were hoarding!\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "36",
        "Recitation":  "Alafasy_128kbps/009036",
        "Body":  "The number of months ordained by Allah is twelve in the Book of\n\t\t\tAllah since the day He created the heavens and the earth. Of\n\t\t\tthese, four are sacred; that is the established principle of\n\t\t\tDeen. Therefore, do not wrong yourselves by violating them. But\n\t\t\tyou may fight against the mushrikin in all these months if they\n\t\t\tfight against you in all of them. Know that Allah is with the\n\t\t\trighteous."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "37",
        "Recitation":  "Alafasy_128kbps/009037",
        "Body":  "Transposing a prohibited month is only an addition to unbelief,\n\t\t\tthereby the disbelievers are misguided. They make a certain month\n\t\t\tlawful one year and in another year they make the same a\n\t\t\tforbidden month, so that they make up for the months which Allah\n\t\t\thas sanctified, thus making lawful what Allah has forbidden.\n\t\t\tTheir evil actions seem pleasing to them. Allah does not guide\n\t\t\tthe disbelieving people."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "38",
        "Recitation":  "Alafasy_128kbps/009038",
        "Body":  "O believers! What is the matter with you that when you are asked\n\t\t\tto march forth in the way of Allah, you cling to the earth? Do\n\t\t\tyou prefer the life of this world to the life of the hereafter?\n\t\t\tIf it is so, then you should know that the comforts of this life\n\t\t\tare little compared to the life of the hereafter."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "39",
        "Recitation":  "Alafasy_128kbps/009039",
        "Body":  "If you do not march forth, He will inflict on you a painful\n\t\t\tpunishment and replace you with other people, and you cannot harm\n\t\t\tHim at all, for Allah has power over everything."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "4",
        "Recitation":  "Alafasy_128kbps/009004",
        "Body":  "Except (this proclamation does not apply to) those mushrikin who\n\t\t\thonored their treaties with you in every detail and aided none\n\t\t\tagainst you. So fulfill your treaties with them to the end of\n\t\t\ttheir term; for Allah loves the righteous."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "40",
        "Recitation":  "Alafasy_128kbps/009040",
        "Body":  "If you do not help the Prophet, it does not matter: Allah did\n\t\t\thelp him when the unbelievers drove him out of his town, the\n\t\t\tsecond of the two, while the two were in the cave and (the enemy\n\t\t\tcame to the opening of the cave) he said to his companion (Abu\n\t\t\tBakr, later the first of the rightly-guided caliphs), \"Do not\n\t\t\tworry, Allah is with us.\" So Allah sent down his serenity on him\n\t\t\tand strengthened him with forces which you can not see, thus, He\n\t\t\tmade the word of the unbelievers lowest, while words of Allah\n\t\t\tremain supreme. Allah is All-Mighty, All-Wise."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "41",
        "Recitation":  "Alafasy_128kbps/009041",
        "Body":  "March forth whether you are equipped lightly or heavily and make\n\t\t\tJihad (exert your utmost) in the way of Allah with your wealth\n\t\t\tand your persons. That is best for you if you understand."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "42",
        "Recitation":  "Alafasy_128kbps/009042",
        "Body":  "As for the hypocrites, if the gain would have been immediate and\n\t\t\tthe journey short, they would have certainly accompanied you, but\n\t\t\tthe long journey (in Tabuk expedition) was too hard for them. To\n\t\t\tjustify their not accompanying you, they would even swear by\n\t\t\tAllah, \"If we were able, we would certainly have marched with\n\t\t\tyou.\" By doing so, they are destroying their own souls, for Allah\n\t\t\tknows that they are liars."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "43",
        "Recitation":  "Alafasy_128kbps/009043",
        "Body":  "Allah forgives you! But why did you (O Muhammad) gave them leave\n\t\t\tto stay behind? (You yourself should have not given them leave)\n\t\t\tso that it would have become clear which of them spoke the truth\n\t\t\tand which of them invented false excuses."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "44",
        "Recitation":  "Alafasy_128kbps/009044",
        "Body":  "Those who believe in Allah and the Last Day will never ask you\n\t\t\tfor exemption from fighting with their wealth and their persons.\n\t\t\tAllah is aware of those who are righteous."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "45",
        "Recitation":  "Alafasy_128kbps/009045",
        "Body":  "Only those people ask for exemption who do not believe in Allah\n\t\t\tand the Last Day and whose hearts are filled with doubt, and are\n\t\t\twavering because of their doubts."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "46",
        "Recitation":  "Alafasy_128kbps/009046",
        "Body":  "If they had intended to march forth, they would certainly have\n\t\t\tmade some preparation for it; but Allah did not like their going\n\t\t\tforth; so He made them lag behind and they were told \"stay behind\n\t\t\twith those who stay behind.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "47",
        "Recitation":  "Alafasy_128kbps/009047",
        "Body":  "Had they gone with you they would have added nothing but\n\t\t\tmischief, and they would have made efforts to create disorder\n\t\t\tamong your ranks, and there would have been some among you who\n\t\t\twould have listened to them. Allah knows the wrongdoers."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "48",
        "Recitation":  "Alafasy_128kbps/009048",
        "Body":  "Indeed they had plotted sedition before and created disturbance\n\t\t\tto make you unsuccessful until the truth came through and the\n\t\t\tdecree of Allah prevailed, even though they disliked it."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "49",
        "Recitation":  "Alafasy_128kbps/009049",
        "Body":  "Among them there is someone (Jad-bin-Qais) who said: \"Grant me\n\t\t\texemption and do not expose me to temptation (of Roman women\u0027s\n\t\t\tbeauty).\" Have they not fallen into temptation (of telling lies,\n\t\t\tdouble dealings and hypocrisy) already? Surely hell has encircled\n\t\t\tthese disbelievers."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "5",
        "Recitation":  "Alafasy_128kbps/009005",
        "Body":  "When the forbidden months (10,11,12 \u0026 1 of the Islamic calendar) are over, then fight the mushrikïn wherever you find them, seize them, besiege them, and lie in ambush for them in every stratagem of war, but if they repent, establish Salah and pay Zakah, then let them go their way: surely Allah is Forgiving, Merciful."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "50",
        "Recitation":  "Alafasy_128kbps/009050",
        "Body":  "If you gain success, it grieves them, but if you face a setback,\n\t\t\tthey say \"We had taken our precautionary measures,\" and turn\n\t\t\taway, rejoicing."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "51",
        "Recitation":  "Alafasy_128kbps/009051",
        "Body":  "O Prophet, tell them: \"Nothing will happen to us except what\n\t\t\tAllah has written for us; He is our protector;\" and in Allah let\n\t\t\tthe believers put their trust."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "52",
        "Recitation":  "Alafasy_128kbps/009052",
        "Body":  "Further tell them: \"Can you expect for us anything other than two\n\t\t\texcellent things (victory or martyrdom)? But we are waiting for\n\t\t\tAllah to afflict you with punishment either from Himself or by\n\t\t\tour hands. So wait if you will; we too are waiting.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "53",
        "Recitation":  "Alafasy_128kbps/009053",
        "Body":  "Say: \"Whether you give willingly or with reluctance, it will not\n\t\t\tbe accepted from you; for you are the people who are\n\t\t\ttransgressors.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "54",
        "Recitation":  "Alafasy_128kbps/009054",
        "Body":  "The reasons which prevent their contributions from being accepted\n\t\t\tare: that they disbelieve in Allah and His Rasool, that they come\n\t\t\tto offer Salah but reluctantly, and that they offer contributions\n\t\t\tbut unwillingly."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "55",
        "Recitation":  "Alafasy_128kbps/009055",
        "Body":  "Let neither their wealth nor their children dazzle you: in\n\t\t\treality Allah intends to punish them with these things in this\n\t\t\tlife and that their souls may depart while they are still\n\t\t\tunbelievers."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "56",
        "Recitation":  "Alafasy_128kbps/009056",
        "Body":  "They swear by Allah that they are indeed believers like you; yet\n\t\t\tthey are not of you; in fact, they are afraid to appear to you in\n\t\t\ttheir true colors."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "57",
        "Recitation":  "Alafasy_128kbps/009057",
        "Body":  "If they could find a place of refuge or a cave, or any\n\t\t\thiding-place, they would certainly run to it with an obstinate\n\t\t\trush."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "58",
        "Recitation":  "Alafasy_128kbps/009058",
        "Body":  "There are some among them who criticize you (O Muhammad)\n\t\t\tconcerning the distribution of sadaqat. If they are given from it\n\t\t\tthey are pleased, and if they are not given from it, lo! They are\n\t\t\tfull of rage."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "59",
        "Recitation":  "Alafasy_128kbps/009059",
        "Body":  "It would have been better for them, if they had only been pleased\n\t\t\twith what Allah and His Rasool had given them and said: \"Allah is\n\t\t\tall-sufficient to us! Soon Allah will give us of His bounty, and\n\t\t\tso will His Rasool. Indeed to Allah do we turn our hopes.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "6",
        "Recitation":  "Alafasy_128kbps/009006",
        "Body":  "If anyone from the mushrikin ask you for asylum, grant it to him\n\t\t\tso that he may hear the Word of Allah, and then escort him to his\n\t\t\tplace of safety: this should be done because these people do not\n\t\t\tknow the truth."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "60",
        "Recitation":  "Alafasy_128kbps/009060",
        "Body":  "In fact the sadaqat (Zakah) collection is for the poor, the\n\t\t\thelpless, those employed to administer the funds, those whose\n\t\t\thearts need to be won over to the truth, ransoming the captives,\n\t\t\thelping the destitute, in the Way of Allah and for the wayfarer.\n\t\t\tThat is a duty enjoined by Allah; and Allah is All-Knowledgeable,\n\t\t\tWise."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "61",
        "Recitation":  "Alafasy_128kbps/009061",
        "Body":  "There are some people among them who molest the Prophet saying:\n\t\t\t\"He is one who believes everything that he hears.\" Say: \"It is\n\t\t\tgood for you that he listens to what is best for you; he believes\n\t\t\tin Allah, has faith in the believers, and is a blessing for those\n\t\t\tof you who are true believers.\" As for those who molest the\n\t\t\tRasool, will have a painful punishment."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "62",
        "Recitation":  "Alafasy_128kbps/009062",
        "Body":  "They swear to you by Allah in order to please you. But it is more\n\t\t\tfitting that they should please Allah and His Rasool if they are\n\t\t\ttrue believers."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "63",
        "Recitation":  "Alafasy_128kbps/009063",
        "Body":  "Don\u0027t they know that anyone who opposes Allah and His Rasool\n\t\t\tshall live forever in the fire of hell? That surely is the worst\n\t\t\thumiliation."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "64",
        "Recitation":  "Alafasy_128kbps/009064",
        "Body":  "The hypocrites are afraid lest a Surah should be sent down about\n\t\t\tthem revealing to the Muslims what is in their hearts. Say: \"Mock\n\t\t\tif you will, Allah will surely bring to light all that you fear.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "65",
        "Recitation":  "Alafasy_128kbps/009065",
        "Body":  "If you ask them, \"what were you talking about?\" They will\n\t\t\tpromptly say: \"We were only jesting and having fun.\" Say: \"What,\n\t\t\tthen! Were you mocking at Allah, His revelations and His Rasool?\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "66",
        "Recitation":  "Alafasy_128kbps/009066",
        "Body":  "Make no excuses now: you have rejected faith after your belief;\n\t\t\teven if We may pardon some of you who were not serious in\n\t\t\tparticipating, We will punish others amongst you, because they\n\t\t\tare criminals."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "67",
        "Recitation":  "Alafasy_128kbps/009067",
        "Body":  "The hypocrite men and the hypocrite women, they are all alike.\n\t\t\tThey enjoin what is evil, forbid what is just, and withhold their\n\t\t\thands from doing good. They have forgotten Allah; so He has\n\t\t\tforgotten them. In fact the hypocrites are transgressors."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "68",
        "Recitation":  "Alafasy_128kbps/009068",
        "Body":  "Allah has promised the hypocrite men, the hypocrite women, and\n\t\t\tthe unbelievers the fire of hell to live therein forever, a\n\t\t\tsufficient recompense. Allah has cursed them and they shall have\n\t\t\ta lasting punishment."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "69",
        "Recitation":  "Alafasy_128kbps/009069",
        "Body":  "Your behavior is just like those who have gone before you. They\n\t\t\twere mightier than you in power and more flourishing in wealth\n\t\t\tand children. They enjoyed their portion of this worldly life;\n\t\t\tthus have you enjoyed your portion as did those before you; and\n\t\t\tyou have entered into vain discourses as they did. Consequently\n\t\t\ttheir deeds were fruitless in this world and in the Hereafter,\n\t\t\tand they are the ones who are the losers."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "7",
        "Recitation":  "Alafasy_128kbps/009007",
        "Body":  "How can there be a treaty with the mushrikin on the part of Allah\n\t\t\tand His Rasool - except for those with whom you ratified a treaty\n\t\t\tat the Masjid-al-Haram? So long as they honor it, you also honor:\n\t\t\tfor Allah loves the righteous."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "70",
        "Recitation":  "Alafasy_128kbps/009070",
        "Body":  "Have they not heard the news of those who have gone before them?\n\t\t\tThe people of Nuh (Noah), Ad and Thamud; the people of Ibrahim\n\t\t\t(Abraham), the men of Madyan and the cities which were\n\t\t\toverthrown. Their Rasools came to them with clear warnings; but\n\t\t\tthey did not listen, Allah did not wrong them, but they wronged\n\t\t\ttheir own souls."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "71",
        "Recitation":  "Alafasy_128kbps/009071",
        "Body":  "The true believers, both men and women, are protectors of one\n\t\t\tanother. They enjoin what is just and forbid what is evil; they\n\t\t\testablish Salah, pay Zakah, and obey Allah and His Rasool. It is\n\t\t\tthey on whom Allah will have His mercy; surely Allah is Mighty,\n\t\t\tWise."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "72",
        "Recitation":  "Alafasy_128kbps/009072",
        "Body":  "Allah has promised to the believers, both men and women, gardens\n\t\t\tbeneath which rivers flow, to live therein forever, and they will\n\t\t\thave beautiful mansions in these gardens of everlasting bliss.\n\t\t\tBest of all, they will have the good pleasure of Allah. Now that\n\t\t\tis the highest achievement."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "73",
        "Recitation":  "Alafasy_128kbps/009073",
        "Body":  "O Prophet! Make Jihad against the unbelievers and the hypocrites\n\t\t\tand be firm against them. Hell shall be their home; and it is the\n\t\t\tworst of all homes."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "74",
        "Recitation":  "Alafasy_128kbps/009074",
        "Body":  "They swear by Allah that they said nothing when in fact they\n\t\t\tuttered the words of unbelief and they committed Kufr after\n\t\t\taccepting Islam. They meditated a plot which they were unable to\n\t\t\tcarry out. They had no reason to be revengeful, except that Allah\n\t\t\tand His Rasool had enriched them through His bounty. Therefore,\n\t\t\tif they repent it will indeed be better for them; but if they\n\t\t\tturn back (do not repent) Allah will punish them with a painful\n\t\t\tpunishment in this life and in the Hereafter, and they shall have\n\t\t\tnone on earth to protect or help them."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "75",
        "Recitation":  "Alafasy_128kbps/009075",
        "Body":  "There are some among them who made a covenant with Allah saying:\n\t\t\t\"If He bestows on us His bounty, we will spend in charity and\n\t\t\tbecome truly of the righteous.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "76",
        "Recitation":  "Alafasy_128kbps/009076",
        "Body":  "But when He did bestow of His bounty they became stingy, turned\n\t\t\tback from their covenant and became evasive."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "77",
        "Recitation":  "Alafasy_128kbps/009077",
        "Body":  "He put hypocrisy into their hearts to last till the Day wherein\n\t\t\tthey shall meet Him as a consequence of their breach of covenant\n\t\t\twith Allah and the lies they told."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "78",
        "Recitation":  "Alafasy_128kbps/009078",
        "Body":  "Are they not aware that Allah knows their secret thoughts and\n\t\t\ttheir secret counsels, and that Allah knows fully well all that\n\t\t\tis hidden?"
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "79",
        "Recitation":  "Alafasy_128kbps/009079",
        "Body":  "As for those that taunt the believers who give freely and\n\t\t\tridicule those who find nothing to give except the fruits of\n\t\t\ttheir labor; Allah will throw back their ridicule on them and\n\t\t\tthey shall have a painful punishment."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "8",
        "Recitation":  "Alafasy_128kbps/009008",
        "Body":  "How can you trust them? If they prevail against you, they respect\n\t\t\tneither treaty nor ties of relationship. They just flatter you\n\t\t\twith their tongues, but their hearts reject you, and most of them\n\t\t\tare transgressors."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "80",
        "Recitation":  "Alafasy_128kbps/009080",
        "Body":  "O Prophet! It is the same, whether you ask forgiveness for them\n\t\t\tor not; even if you ask for their forgiveness seventy times,\n\t\t\tAllah is not going to forgive them: because they have disbelieved\n\t\t\tAllah and His Rasool. Allah does not guide those who are\n\t\t\ttransgressors."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "81",
        "Recitation":  "Alafasy_128kbps/009081",
        "Body":  "Those who remained behind (did not join the Tabuk expedition)\n\t\t\twere delighted to sit inactive behind Allah\u0027s Rasool, and they\n\t\t\thated to make Jihad with their goods and their persons in the\n\t\t\tcause of Allah. They said to each other \"Do not go forth in the\n\t\t\theat.\" Say to them: \"The fire of hell is much more severe in\n\t\t\theat.\" If only they could understand!"
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "82",
        "Recitation":  "Alafasy_128kbps/009082",
        "Body":  "Let them laugh a little; much will they weep as a recompense for\n\t\t\twhat they have earned."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "83",
        "Recitation":  "Alafasy_128kbps/009083",
        "Body":  "From now on, if Allah brings you among them and any of them ask\n\t\t\tyour permission to go forth for Jihad, say: \"You shall never be\n\t\t\tallowed to go forth with me nor fight an enemy in my company. You\n\t\t\tchose to sit inactive on the first occasion, therefore you shall\n\t\t\tnow stay with those who stay behind.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "84",
        "Recitation":  "Alafasy_128kbps/009084",
        "Body":  "You shall never offer funeral prayer for any of them who dies,\n\t\t\tnor shall you attend their burial, for they have denied Allah and\n\t\t\tHis Rasool and died while they were transgressors."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "85",
        "Recitation":  "Alafasy_128kbps/009085",
        "Body":  "Let neither their wealth nor their children dazzle you. Through\n\t\t\tthese Allah wants to punish them in this world and let their\n\t\t\tsouls depart while they are still disbelievers."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "86",
        "Recitation":  "Alafasy_128kbps/009086",
        "Body":  "Whenever a Surah is revealed, saying: \" Believe in Allah and make\n\t\t\tJihad along with His Rasool,\" capable people among them ask you\n\t\t\tfor exemption, saying: \"Please leave us with those who are to\n\t\t\tstay at home.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "87",
        "Recitation":  "Alafasy_128kbps/009087",
        "Body":  "They preferred to be with those who remain behind, as a result, a\n\t\t\tseal was set upon their hearts so that they do not understand."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "88",
        "Recitation":  "Alafasy_128kbps/009088",
        "Body":  "But the Rasool and those who believe with him, make Jihad with\n\t\t\ttheir wealth and their persons. They are the ones who will have\n\t\t\tall the goodness, and they are the ones who will be successful."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "89",
        "Recitation":  "Alafasy_128kbps/009089",
        "Body":  "Allah has prepared for them gardens beneath which rivers flow, to\n\t\t\tlive therein forever: that is the greatest achievement."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "9",
        "Recitation":  "Alafasy_128kbps/009009",
        "Body":  "They have sold the revelations of Allah for paltry worldly gain\n\t\t\tand they have hindered others from His way; indeed evil are the\n\t\t\tdeeds that they have done."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "90",
        "Recitation":  "Alafasy_128kbps/009090",
        "Body":  "Some from among the desert Arabs also came with their excuses,\n\t\t\tbegging exemption to stay behind; thus, those who lied to Allah\n\t\t\tand His Rasool sat inactive. Soon a painful punishment shall\n\t\t\tseize those of them who disbelieved."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "91",
        "Recitation":  "Alafasy_128kbps/009091",
        "Body":  "There is no blame on the disabled, the sick, and those lacking\n\t\t\tthe means, to stay behind so long as they are sincere to Allah\n\t\t\tand His Rasool. There is no way (blame) against those righteous\n\t\t\tpeople. Allah is Forgiving, Merciful."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "92",
        "Recitation":  "Alafasy_128kbps/009092",
        "Body":  "Likewise, there is no blame on those who came to you and\n\t\t\trequested the conveyance to the battlefront and you said: \"I am\n\t\t\tunable to provide you the conveyance,\" and they returned with\n\t\t\ttheir eyes streaming with tears; they were filled with sorrow\n\t\t\tthat they had no resources of going forth to the battlefield at\n\t\t\ttheir own expense."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "93",
        "Recitation":  "Alafasy_128kbps/009093",
        "Body":  "The way (blame) is only against those who begged exemption\n\t\t\talthough they are rich. They preferred to be with those who\n\t\t\tremained behind. Allah has set a seal upon their hearts; so they\n\t\t\tdo not know what they missed."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "94",
        "Recitation":  "Alafasy_128kbps/009094",
        "Body":  "They will apologize to you with all sorts of excuses when you\n\t\t\treturn to them. Say: \"Present no excuses: we shall not believe\n\t\t\tyou: Allah has already revealed to us the whole truth about you.\n\t\t\tNow Allah and His Rasool will keep a watch over your conduct: in\n\t\t\tthe end you will return to Him who knows what is hidden and what\n\t\t\tis open, and He will tell you all that you have been doing.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "95",
        "Recitation":  "Alafasy_128kbps/009095",
        "Body":  "They will swear to you by Allah when you return to them so that\n\t\t\tyou may leave them alone. So leave them alone: they are filth.\n\t\t\tHell shall be their abode, a punishment for their misdeeds."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "96",
        "Recitation":  "Alafasy_128kbps/009096",
        "Body":  "They will swear to you in order to please you, but even if you be\n\t\t\tpleased with them (accept their excuses), Allah will never be\n\t\t\tpleased with these transgressors."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "97",
        "Recitation":  "Alafasy_128kbps/009097",
        "Body":  "The Arabs of the desert are the worst in disbelief and hypocrisy,\n\t\t\tand are least inclined to acknowledge the limits that Allah has\n\t\t\trevealed to his Rasool. Allah is All-Knowledgeable, All-Wise."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "98",
        "Recitation":  "Alafasy_128kbps/009098",
        "Body":  "Some of the desert Arabs look upon whatever they spend in the way\n\t\t\tof Allah as a penalty and wait for some misfortune to befall you.\n\t\t\tMay misfortune befall them! Allah hears all and knows all."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "9",
        "AyahNumber":  "99",
        "Recitation":  "Alafasy_128kbps/009099",
        "Body":  "But some of the desert Arabs believe in Allah and the Last Day,\n\t\t\tand look on what they spend in the way of Allah as a means of\n\t\t\tbringing them close to Allah and to the prayers of the Rasool.\n\t\t\tIndeed, closer they shall be brought: soon Allah will admit them\n\t\t\tto His mercy. Allah is Forgiving, Merciful."
    }
]
