[
    {
        "BookCode":  "MAL",
        "SurahNumber":  "49",
        "AyahNumber":  "1",
        "Recitation":  "Alafasy_128kbps/049001",
        "Body":  "O believers! Do not put yourselves ahead of Allah and His Rasool.\n\t\t\tFear Allah; surely Allah hears all and knows all."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "49",
        "AyahNumber":  "10",
        "Recitation":  "Alafasy_128kbps/049010",
        "Body":  "The believers are brothers to one another, therefore, make\n\t\t\treconciliation between your brothers and fear Allah, so that you\n\t\t\tmay be shown mercy."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "49",
        "AyahNumber":  "11",
        "Recitation":  "Alafasy_128kbps/049011",
        "Body":  "O believers! Let no men laugh at other men who may perhaps be\n\t\t\tbetter than themselves; and let no woman laugh at another woman,\n\t\t\twho may perhaps be better than herself. Do not defame through\n\t\t\tsarcastic remarks about one another, nor call one another by\n\t\t\toffensive nicknames. It is an evil thing to be called by a bad\n\t\t\tname after being a believer, and those who do not repent are the\n\t\t\tones who are the wrongdoers."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "49",
        "AyahNumber":  "12",
        "Recitation":  "Alafasy_128kbps/049012",
        "Body":  "O believers! Avoid immoderate suspicion, for in some cases\n\t\t\tsuspicion is a sin. Do not spy on one another, nor backbite one\n\t\t\tanother (to say something about another behind ones back that if\n\t\t\tone hears it, dislikes it). Would any of you like to eat the\n\t\t\tflesh of his dead brother? Surely you would abhor it. Fear Allah;\n\t\t\tfor Allah is the Accepter of repentance, Merciful."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "49",
        "AyahNumber":  "13",
        "Recitation":  "Alafasy_128kbps/049013",
        "Body":  "O mankind! We created you from a single pair of a male and a\n\t\t\tfemale, and made you into nations and tribes that you might get\n\t\t\tto know one another. Surely the noblest of you in the sight of\n\t\t\tAllah is he who is the most righteous. Allah is\n\t\t\tAll-Knowledgeable, All-Aware."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "49",
        "AyahNumber":  "14",
        "Recitation":  "Alafasy_128kbps/049014",
        "Body":  "The beduin Arabs say: \"We have believed.\" Tell them: \"You have\n\t\t\tnot believed; rather say \u0027We have become Muslims;\u0027 for faith has\n\t\t\tnot yet found its way into your hearts. If you obey Allah and His\n\t\t\tRasool, He will not deny you the reward of your deeds; surely\n\t\t\tAllah is Forgiving, Merciful.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "49",
        "AyahNumber":  "15",
        "Recitation":  "Alafasy_128kbps/049015",
        "Body":  "The true believers are those who believe in Allah and His Rasool,\n\t\t\tthen never doubt; and make Jihad (exert their efforts) with their\n\t\t\twealth and their persons in the cause of Allah. Such are the ones\n\t\t\twho are truthful in their claim to be the believers."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "49",
        "AyahNumber":  "16",
        "Recitation":  "Alafasy_128kbps/049016",
        "Body":  "O Prophet say to those who claim to have believed: \"Do you\n\t\t\tapprise Allah of your religion? Whereas, Allah knows all that is\n\t\t\tin the heavens and the earth and He has full knowledge of\n\t\t\teverything.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "49",
        "AyahNumber":  "17",
        "Recitation":  "Alafasy_128kbps/049017",
        "Body":  "They think they have conferred upon you a favor by embracing\n\t\t\tIslam. Tell them: \"You have conferred upon me no favor by\n\t\t\taccepting Islam. It was Allah Who has conferred a favor upon you\n\t\t\tin guiding you to the true faith; admit this, if you are men of\n\t\t\ttruth."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "49",
        "AyahNumber":  "18",
        "Recitation":  "Alafasy_128kbps/049018",
        "Body":  "Surely Allah knows the secrets of the heavens and the earth; and\n\t\t\tAllah is watching all your actions.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "49",
        "AyahNumber":  "2",
        "Recitation":  "Alafasy_128kbps/049002",
        "Body":  "O believers! Do not raise your voices above the voice of the\n\t\t\tProphet, nor speak aloud when talking to him as you speak aloud\n\t\t\tto one another, lest your deeds should come to nothing while you\n\t\t\tdo not even perceive it."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "49",
        "AyahNumber":  "3",
        "Recitation":  "Alafasy_128kbps/049003",
        "Body":  "Those who lower their voices and speak softly in the presence of\n\t\t\tAllah\u0027s Rasool are the ones whose hearts Allah has tested for\n\t\t\tpiety; they shall have forgiveness and a great reward."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "49",
        "AyahNumber":  "4",
        "Recitation":  "Alafasy_128kbps/049004",
        "Body":  "Those who call out to you, O Muhammad, from outside the private\n\t\t\tapartments, most of them lack common sense."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "49",
        "AyahNumber":  "5",
        "Recitation":  "Alafasy_128kbps/049005",
        "Body":  "If only they had patience until you could come out to them, it\n\t\t\twould certainly be better for them. Allah is Forgiving, Merciful."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "49",
        "AyahNumber":  "6",
        "Recitation":  "Alafasy_128kbps/049006",
        "Body":  "O believers, if an evildoer comes to you with some news, verify\n\t\t\tit (investigate to ascertain the truth), lest you should harm\n\t\t\tothers unwittingly and then regret what you have done."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "49",
        "AyahNumber":  "7",
        "Recitation":  "Alafasy_128kbps/049007",
        "Body":  "And know that Allah\u0027s Rasool is among you. If he were to follow\n\t\t\tyou in most affairs, you would certainly be in trouble. Allah has\n\t\t\tendeared this faith to you and beautified it in your hearts,\n\t\t\tmaking unbelief, wrongdoing, and disobedience abhorrent to you.\n\t\t\tIt is they who are rightly guided"
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "49",
        "AyahNumber":  "8",
        "Recitation":  "Alafasy_128kbps/049008",
        "Body":  "through Allah\u0027s grace and blessing. Allah is Knowledgeable, Wise."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "49",
        "AyahNumber":  "9",
        "Recitation":  "Alafasy_128kbps/049009",
        "Body":  "If two parties among the believers fall into mutual fighting,\n\t\t\tmake peace between them. Then if one of them transgresses against\n\t\t\tthe other, fight the one who has transgressed until he returns to\n\t\t\tthe commands of Allah. Then, if he returns, make peace between\n\t\t\tthem with justice and be fair; for Allah loves those who are fair\n\t\t\tand just."
    }
]
