[
    {
        "BookCode":  "MAL",
        "SurahNumber":  "42",
        "AyahNumber":  "1",
        "Recitation":  "Alafasy_128kbps/042001",
        "Body":  "Ha M\u0027im."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "42",
        "AyahNumber":  "10",
        "Recitation":  "Alafasy_128kbps/042010",
        "Body":  "O Prophet tell them: Whatever the subject of your dispute is, its\n\t\t\tjudgement belongs to Allah: Such is Allah my Rabb, in Him I have\n\t\t\tput my trust, and to Him I turn in repentance."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "42",
        "AyahNumber":  "11",
        "Recitation":  "Alafasy_128kbps/042011",
        "Body":  "The Creator of the heavens and the earth. He has made for you\n\t\t\tmates from among yourselves and also mates among the cattle from\n\t\t\ttheir own kind; by this means does He multiply you. There is no\n\t\t\tone like Him. He Alone hears all and sees all."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "42",
        "AyahNumber":  "12",
        "Recitation":  "Alafasy_128kbps/042012",
        "Body":  "To Him belongs the keys of the heavens and the earth. He gives\n\t\t\tabundantly to whom He pleases and sparingly to whom He wills. He\n\t\t\tis the Knower of everything."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "42",
        "AyahNumber":  "13",
        "Recitation":  "Alafasy_128kbps/042013",
        "Body":  "He has ordained for you the same Deen (way of life - Islam) which\n\t\t\tHe enjoined on Nuh - and which We have revealed to you O Muhammad\n\t\t\t- and which We enjoined on Ibrahim and Musa (Moses) and Isa\n\t\t\t(Jesus): \"Establish the Deen of Al-Islam and make no division\n\t\t\t(sects) in it.\" Intolerable for the mushrikin is that to which\n\t\t\tyou O Muhammad call them. Allah chooses for His service whom He\n\t\t\twills, and guides to His Way only those who turn to Him in\n\t\t\trepentance."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "42",
        "AyahNumber":  "14",
        "Recitation":  "Alafasy_128kbps/042014",
        "Body":  "The people did not become divided into sects until after\n\t\t\tknowledge had come to them out of envy among themselves. Had your\n\t\t\tRabb not issued the word to defer their punishment till an\n\t\t\tappointed time, the matter would have already been settled\n\t\t\tbetween them. The fact is that those who were made to inherit the\n\t\t\tBook after them, are surely in disquieting doubt concerning it."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "42",
        "AyahNumber":  "15",
        "Recitation":  "Alafasy_128kbps/042015",
        "Body":  "Therefore, call them to the true Deen, stay firm on the Right Way\n\t\t\tas you are commanded and do not follow their vain desires. Tell\n\t\t\tthem: \"I believe in whatever Allah has revealed from the Book and\n\t\t\tI am commanded to do justice between you. Allah is Our Rabb and\n\t\t\tyour Rabb. We are responsible for Our deeds and you for yours.\n\t\t\tLet there be no dispute among us. Allah will bring us all\n\t\t\ttogether on the Day of Judgement and decide as to who is right\n\t\t\tand who is wrong. Towards Him lies the goal."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "42",
        "AyahNumber":  "16",
        "Recitation":  "Alafasy_128kbps/042016",
        "Body":  "Those who dispute concerning Allah after pledging obedience to\n\t\t\tHim, their dispute is futile in the sight of their Rabb, on them\n\t\t\tis His wrath and for them there will be a terrible punishment."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "42",
        "AyahNumber":  "17",
        "Recitation":  "Alafasy_128kbps/042017",
        "Body":  "It is Allah Who has revealed this Book (Al-Qur\u0027an) with the\n\t\t\ttruth, and the Balance (to distinguish between right and wrong).\n\t\t\tWhat will make you realize that perhaps the hour of doom may be\n\t\t\tfast approaching."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "42",
        "AyahNumber":  "18",
        "Recitation":  "Alafasy_128kbps/042018",
        "Body":  "Only those who deny it seek to hasten it on; but the believers\n\t\t\tdread its coming and know that its coming is the truth. Behold!\n\t\t\tThose who dispute concerning the hour of doom are far astray."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "42",
        "AyahNumber":  "19",
        "Recitation":  "Alafasy_128kbps/042019",
        "Body":  "Allah is very Kind to His servants. He gives sustenance to whom\n\t\t\tHe pleases. He is the Powerful, the Almighty.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "42",
        "AyahNumber":  "2",
        "Recitation":  "Alafasy_128kbps/042002",
        "Body":  "\u0027Ain Sin Qaf."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "42",
        "AyahNumber":  "20",
        "Recitation":  "Alafasy_128kbps/042020",
        "Body":  "He who desires the harvest of the hereafter, shall be given a\n\t\t\tmany fold increase in his harvest; and he who desires the harvest\n\t\t\tof this world, a share of it shall be given to him: but in the\n\t\t\thereafter he shall have no share at all."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "42",
        "AyahNumber":  "21",
        "Recitation":  "Alafasy_128kbps/042021",
        "Body":  "Have they made shoraka\u0027 (partners with Allah) who, in the\n\t\t\tpractice of their faith, have made lawful to them what Allah has\n\t\t\tnot allowed? Had a decision of making the decision on the Day of\n\t\t\tJudgement not been issued already, the matter would have\n\t\t\tcertainly been decided between them; surely the wrongdoers will\n\t\t\thave a painful punishment."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "42",
        "AyahNumber":  "22",
        "Recitation":  "Alafasy_128kbps/042022",
        "Body":  "You will see that the wrongdoers will be fearing the bad\n\t\t\tconsequences of their deeds which will surely befall them. While\n\t\t\tthose who believe and do good deeds shall dwell in the luxurious\n\t\t\tgardens of paradise, and shall receive from their Rabb all that\n\t\t\tthey wish for; that will surely be the magnificent blessing."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "42",
        "AyahNumber":  "23",
        "Recitation":  "Alafasy_128kbps/042023",
        "Body":  "Such a blessing is the good news which Allah gives to His\n\t\t\tservants who believe and do good deeds. O Prophet, say to them:\n\t\t\t\"I do not ask you any recompense except your love for being my\n\t\t\tclose relatives.\" He that does a good deed shall be repaid many\n\t\t\ttimes over. Surely Allah is oft-Forgiving, most Appreciative."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "42",
        "AyahNumber":  "24",
        "Recitation":  "Alafasy_128kbps/042024",
        "Body":  "Do they say: \"He has forged a falsehood against Allah?\" But if\n\t\t\tAllah so willed, He could have sealed your heart. In fact Allah\n\t\t\tblots out falsehood and vindicates the truth by His words. Surely\n\t\t\tHe knows everything that is hidden in your breast."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "42",
        "AyahNumber":  "25",
        "Recitation":  "Alafasy_128kbps/042025",
        "Body":  "It is He Who accepts repentance from His servants and pardons\n\t\t\ttheir sins, and He knows whatever you do."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "42",
        "AyahNumber":  "26",
        "Recitation":  "Alafasy_128kbps/042026",
        "Body":  "He answers the prayers of those who believe and do good deeds and\n\t\t\tgives them even more out of His bounty. As for the unbelievers,\n\t\t\tthey shall have severe punishment."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "42",
        "AyahNumber":  "27",
        "Recitation":  "Alafasy_128kbps/042027",
        "Body":  "Had Allah bestowed abundance upon His servants, they would have\n\t\t\ttransgressed beyond bounds in the earth; that\u0027s why He sends down\n\t\t\tin due measure as He pleases; He is well aware and observant of\n\t\t\tHis servants."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "42",
        "AyahNumber":  "28",
        "Recitation":  "Alafasy_128kbps/042028",
        "Body":  "It is He Who sends down rain even after they have lost all hope,\n\t\t\tand spreads His Mercy. He Alone is the Praiseworthy Guardian."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "42",
        "AyahNumber":  "29",
        "Recitation":  "Alafasy_128kbps/042029",
        "Body":  "Among His signs is the creation of the heavens and the earth, and\n\t\t\tthe living creatures that He has spread in both of them: and He\n\t\t\tis capable of gathering them all together whenever He wants."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "42",
        "AyahNumber":  "3",
        "Recitation":  "Alafasy_128kbps/042003",
        "Body":  "Thus, Allah All-Mighty, the All-Wise sends His revelation to you,\n\t\t\tO Muhammad, as He sent to other Rasools before you."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "42",
        "AyahNumber":  "30",
        "Recitation":  "Alafasy_128kbps/042030",
        "Body":  "Whatever affliction befalls you is the result of what your own\n\t\t\thands have done even though for many of your misdeeds He grants\n\t\t\tforgiveness."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "42",
        "AyahNumber":  "31",
        "Recitation":  "Alafasy_128kbps/042031",
        "Body":  "You cannot frustrate anything in earth and there is no protector\n\t\t\tor helper for you besides Allah."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "42",
        "AyahNumber":  "32",
        "Recitation":  "Alafasy_128kbps/042032",
        "Body":  "Among His signs are the ships which look like mountains upon the\n\t\t\tocean."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "42",
        "AyahNumber":  "33",
        "Recitation":  "Alafasy_128kbps/042033",
        "Body":  "If He wants, He can cause the wind to become still and leave them\n\t\t\tmotionless on their backs - surely in this example there are\n\t\t\tsigns for every such person who patiently endures and is\n\t\t\tgrateful."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "42",
        "AyahNumber":  "34",
        "Recitation":  "Alafasy_128kbps/042034",
        "Body":  "- Or He may cause them to drown in consequence of even a few of\n\t\t\ttheir misdeeds, though He forgives many of their misdeeds."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "42",
        "AyahNumber":  "35",
        "Recitation":  "Alafasy_128kbps/042035",
        "Body":  "Those who dispute about Our revelations should know that there is\n\t\t\tno escape for them."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "42",
        "AyahNumber":  "36",
        "Recitation":  "Alafasy_128kbps/042036",
        "Body":  "Whatever you are given is nothing but a provision for the\n\t\t\ttransitory life of this world, better and ever lasting is the\n\t\t\treward which Allah has for those who believe, put their trust in\n\t\t\ttheir Rabb,"
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "42",
        "AyahNumber":  "37",
        "Recitation":  "Alafasy_128kbps/042037",
        "Body":  "avoid major sins and shameful deeds, forgive even when they are\n\t\t\tangry;"
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "42",
        "AyahNumber":  "38",
        "Recitation":  "Alafasy_128kbps/042038",
        "Body":  "answer the call of their Rabb, establish Salah, conduct their\n\t\t\taffairs with mutual consultation, spend out of the sustenance\n\t\t\twhich We have given them,"
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "42",
        "AyahNumber":  "39",
        "Recitation":  "Alafasy_128kbps/042039",
        "Body":  "and when they are oppressed, help and defend themselves."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "42",
        "AyahNumber":  "4",
        "Recitation":  "Alafasy_128kbps/042004",
        "Body":  "To Him belongs all that is in the heavens and the earth. He is\n\t\t\tthe Supreme, the Great."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "42",
        "AyahNumber":  "40",
        "Recitation":  "Alafasy_128kbps/042040",
        "Body":  "The recompense for an injury is an injury proportionate to it;\n\t\t\tbut if a person forgives and makes reconciliation he shall be\n\t\t\trewarded by Allah; He does not like the wrongdoers."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "42",
        "AyahNumber":  "41",
        "Recitation":  "Alafasy_128kbps/042041",
        "Body":  "Those who avenge themselves when wronged cannot be blamed."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "42",
        "AyahNumber":  "42",
        "Recitation":  "Alafasy_128kbps/042042",
        "Body":  "The blameworthy are those who oppress their fellow men and\n\t\t\tconduct themselves with wickedness and injustice in the land. It\n\t\t\tis they who will have painful punishment."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "42",
        "AyahNumber":  "43",
        "Recitation":  "Alafasy_128kbps/042043",
        "Body":  "Those who endure with fortitude and forgive others, surely\n\t\t\texhibit great courage in conducting their affairs."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "42",
        "AyahNumber":  "44",
        "Recitation":  "Alafasy_128kbps/042044",
        "Body":  "He whom Allah let go astray has no protector after Him. When they\n\t\t\twill face the punishment, you will see the wrongdoers exclaim:\n\t\t\t\"Is there any way back to the world?\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "42",
        "AyahNumber":  "45",
        "Recitation":  "Alafasy_128kbps/042045",
        "Body":  "You will see them brought before awed and humiliated, looking at\n\t\t\tit with stealthy glances. The true believers will say: \"The real\n\t\t\tlosers indeed are those who have lost themselves and their\n\t\t\tfamilies on the Day of Resurrection.\" Beware! Surely the\n\t\t\twrongdoers shall suffer everlasting punishment."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "42",
        "AyahNumber":  "46",
        "Recitation":  "Alafasy_128kbps/042046",
        "Body":  "They shall have no protectors who could help them besides Allah.\n\t\t\tThe one whom Allah lets go astray has no way of escape."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "42",
        "AyahNumber":  "47",
        "Recitation":  "Alafasy_128kbps/042047",
        "Body":  "Answer the call of your Rabb before that Day arrives which cannot\n\t\t\tbe averted against the will of Allah. There shall be no refuge\n\t\t\tfor you on that Day, nor shall you be able to deny your sins."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "42",
        "AyahNumber":  "48",
        "Recitation":  "Alafasy_128kbps/042048",
        "Body":  "Now if they give no heed, they should know that We have not sent\n\t\t\tyou, O Muhammad, to be their keeper. Your only duty is to convey\n\t\t\tMy message. Man is such that when We give him a taste of Our\n\t\t\tMercy, he is very happy about it; but when, through his own\n\t\t\tfault, an evil afflicts him, he becomes utterly ungrateful.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "42",
        "AyahNumber":  "49",
        "Recitation":  "Alafasy_128kbps/042049",
        "Body":  "To Allah belongs the kingdom of the heavens and the earth. He\n\t\t\tcreates whatever He pleases. He gives daughters to whom He\n\t\t\tpleases and gives sons to whom He pleases."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "42",
        "AyahNumber":  "5",
        "Recitation":  "Alafasy_128kbps/042005",
        "Body":  "The heavens might have almost broken apart from above those who\n\t\t\tare elevating Allah\u0027s creatures to His rank, if the angels would\n\t\t\thave not been glorifying their Rabb with His praise and begging\n\t\t\tforgiveness for those on earth. Behold! Surely it is Allah Who is\n\t\t\tthe oft-Forgiving, most Merciful."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "42",
        "AyahNumber":  "50",
        "Recitation":  "Alafasy_128kbps/042050",
        "Body":  "To some He gives both sons and daughters, and makes barren whom\n\t\t\tHe will; surely He is All-knowledgeable, All-Powerful."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "42",
        "AyahNumber":  "51",
        "Recitation":  "Alafasy_128kbps/042051",
        "Body":  "It is not vouchsafed to any human being that Allah should speak\n\t\t\tto him face to face, He speaks either through inspiration, or\n\t\t\tfrom behind a veil, or through sending a messenger (angel\n\t\t\tGabriel) authorized by Him to reveal His will; surely He is most\n\t\t\tHigh, most Wise."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "42",
        "AyahNumber":  "52",
        "Recitation":  "Alafasy_128kbps/042052",
        "Body":  "Thus, have We revealed to you O Muhammad, a Spirit (inspired Book\n\t\t\t- The Qur\u0027an) by Our command: while you did not know what is The\n\t\t\tBook and what is the Iman (faith)? But We have made it (The\n\t\t\tQur\u0027an) a light whereby We guide those of Our servants whom We\n\t\t\tplease; and surely you are guiding mankind to the Right Way"
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "42",
        "AyahNumber":  "53",
        "Recitation":  "Alafasy_128kbps/042053",
        "Body":  "the Way of Allah - to whom belongs all that is in the heavens and\n\t\t\tthe earth. Beware! All affairs will eventually return to Allah\n\t\t\tfor a decision."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "42",
        "AyahNumber":  "6",
        "Recitation":  "Alafasy_128kbps/042006",
        "Body":  "Those who take others as their guardians besides Him, Allah\n\t\t\tHimself is watching them; and O Prophet, you are not the disposer\n\t\t\tof their affairs."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "42",
        "AyahNumber":  "7",
        "Recitation":  "Alafasy_128kbps/042007",
        "Body":  "Thus have We revealed to you this Qur\u0027an in Arabic, so that you\n\t\t\tmay warn the residents of the Mother City (Makkah) and its\n\t\t\tsuburbs, and forewarn them of the Day of assembly about which\n\t\t\tthere is no doubt: when some will go to paradise and others to\n\t\t\tthe blazing fire."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "42",
        "AyahNumber":  "8",
        "Recitation":  "Alafasy_128kbps/042008",
        "Body":  "If Allah wanted, He could have made all of them a single nation;\n\t\t\tbut He admits to His mercy whom He pleases; as for the\n\t\t\twrongdoers, they will have no protector nor helper."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "42",
        "AyahNumber":  "9",
        "Recitation":  "Alafasy_128kbps/042009",
        "Body":  "Have they set up other guardians beside Him, while Allah Alone is\n\t\t\tthe Guardian? It is He Who gives life to the dead and it is He\n\t\t\tWho has power over all things."
    }
]
