[
    {
        "BookCode":  "MAL",
        "SurahNumber":  "46",
        "AyahNumber":  "1",
        "Recitation":  "Alafasy_128kbps/046001",
        "Body":  "Ha M\u0027im."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "46",
        "AyahNumber":  "10",
        "Recitation":  "Alafasy_128kbps/046010",
        "Body":  "Further say: \"Think, if this Qur\u0027an is indeed from Allah and you\n\t\t\treject it, when a witness (a Jew) from the children of Israel has\n\t\t\talso testified to its similarity with earlier scriptures and has\n\t\t\tbelieved (accepted Islam), while you are showing arrogance, how\n\t\t\tunjust you are! Surely Allah does not guide the unjust people.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "46",
        "AyahNumber":  "11",
        "Recitation":  "Alafasy_128kbps/046011",
        "Body":  "The unbelievers say about the believers: \"Had there been any good\n\t\t\tto believe in, this Qur\u0027an, they would not have believed in it\n\t\t\tbefore us.\" And since they reject its guidance, they say: \"This\n\t\t\tis an ancient falsehood.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "46",
        "AyahNumber":  "12",
        "Recitation":  "Alafasy_128kbps/046012",
        "Body":  "Yet before it the Book of Musa was revealed which was a guide and\n\t\t\tblessing; and this Book (Qur\u0027an) confirms it. It is revealed in\n\t\t\tthe Arabic language to forewarn the wrongdoers and to give good\n\t\t\tnews to those who have adopted the righteous conduct."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "46",
        "AyahNumber":  "13",
        "Recitation":  "Alafasy_128kbps/046013",
        "Body":  "Indeed those who say: \"Our Rabb is Allah, and then remain firm\n\t\t\tshall have nothing to fear or to regret."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "46",
        "AyahNumber":  "14",
        "Recitation":  "Alafasy_128kbps/046014",
        "Body":  "They shall dwell in paradise forever as a reward for their good\n\t\t\tdeeds."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "46",
        "AyahNumber":  "15",
        "Recitation":  "Alafasy_128kbps/046015",
        "Body":  "We have enjoined man to treat his parents with kindness. With\n\t\t\tmuch trouble his mother bore him, and much pain did she give him\n\t\t\tbirth. His bearing and his weaning took thirty months. When he\n\t\t\treaches the age of full strength and becomes forty years old, he\n\t\t\tsays: \"My Rabb! Grant me the grace that I may thank you for the\n\t\t\tfavors which You have bestowed on me and on my parents, and that\n\t\t\tI may do good deeds that will please You, and grant me good\n\t\t\tchildren. Surely I turn to You in repentance and surely I am of\n\t\t\tthose who are Muslims.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "46",
        "AyahNumber":  "16",
        "Recitation":  "Alafasy_128kbps/046016",
        "Body":  "Such are the people from whom We shall accept the best of their\n\t\t\tdeeds and overlook their misdeeds. They shall be among the\n\t\t\tresidents of paradise: true is the promise that has been made to\n\t\t\tthem in this life."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "46",
        "AyahNumber":  "17",
        "Recitation":  "Alafasy_128kbps/046017",
        "Body":  "But those who rebukes his parents and say: \"Uff (as if to say, do\n\t\t\tnot bothering me)! Do you threaten me with a resurrection,\n\t\t\twhereas many a generations have passed before me and none has\n\t\t\tcome back from among them?\" And they both cry for Allah\u0027s help\n\t\t\tand say: \"Woe to you! Be a good believer. Surely the promise of\n\t\t\tAllah is true.\" But he replies: \"This is nothing but tales of the\n\t\t\tancients.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "46",
        "AyahNumber":  "18",
        "Recitation":  "Alafasy_128kbps/046018",
        "Body":  "Such are the people against whom the verdict of torment has\n\t\t\tproved true and they will be among the prior people of the jinns\n\t\t\tand the men that have passed away before them. Indeed they will\n\t\t\tbe the losers."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "46",
        "AyahNumber":  "19",
        "Recitation":  "Alafasy_128kbps/046019",
        "Body":  "All will be assigned in ranks, according to their deeds, so that\n\t\t\tHe may reward them fully for what they have done and they shall\n\t\t\tnot be wronged."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "46",
        "AyahNumber":  "2",
        "Recitation":  "Alafasy_128kbps/046002",
        "Body":  "This Book is revealed by Allah, the All-Mighty, the All-Wise."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "46",
        "AyahNumber":  "20",
        "Recitation":  "Alafasy_128kbps/046020",
        "Body":  "On that Day when the disbelievers will be brought before the\n\t\t\tfire, they will be told: \"You squandered away your good things in\n\t\t\tyour earthly life and you enjoyed them for a while. Today you\n\t\t\tshall be recompensed with a punishment of humiliation because you\n\t\t\tbehaved with arrogance for which you had no right during your\n\t\t\tlife on earth and because of the transgressions you committed.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "46",
        "AyahNumber":  "21",
        "Recitation":  "Alafasy_128kbps/046021",
        "Body":  "Tell them the story of \u0027Ad\u0027s brethren, the Prophet Hud, when he\n\t\t\twarned his people, the residents of Ahqaf - in fact Warners came\n\t\t\tto them before him and after him - saying: \"Worship none but\n\t\t\tAllah. Surely I fear for you the torment of a mighty Day.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "46",
        "AyahNumber":  "22",
        "Recitation":  "Alafasy_128kbps/046022",
        "Body":  "They replied: \"Have you come to turn us away from our gods? Bring\n\t\t\tus the torment that you threaten us with, if you are telling the\n\t\t\ttruth.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "46",
        "AyahNumber":  "23",
        "Recitation":  "Alafasy_128kbps/046023",
        "Body":  "The Prophet Hud said: \"The Knowledge of when it is going to come\n\t\t\tis only with Allah. I am only conveying the Message with which I\n\t\t\thave been sent, however, I can see that you are ignorant people.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "46",
        "AyahNumber":  "24",
        "Recitation":  "Alafasy_128kbps/046024",
        "Body":  "Then when they saw the torment in the shape of a cloud coming\n\t\t\ttowards their valleys, they said: \"This cloud will bring us\n\t\t\train.\" - \"Nay! It is what you were asking for, a fierce wind\n\t\t\tbringing you a woeful torment."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "46",
        "AyahNumber":  "25",
        "Recitation":  "Alafasy_128kbps/046025",
        "Body":  "It is going to destroy everything by the command of its Rabb.\n\t\t\tConsequently by the morning, there was nothing to be seen except\n\t\t\tthe ruins of their dwellings. Thus did We reward those guilty\n\t\t\tpeople."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "46",
        "AyahNumber":  "26",
        "Recitation":  "Alafasy_128kbps/046026",
        "Body":  "We had established them much better than We have established you,\n\t\t\tO Qureysh of Makkah, and endowed them with the faculties of\n\t\t\thearing, seeing, and intellect. Yet their faculties of hearing,\n\t\t\tsight and intellect avail them nothing since they denied the\n\t\t\trevelations of Allah; and they were completely hemmed in by the\n\t\t\tsame thing that they used to mock at."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "46",
        "AyahNumber":  "27",
        "Recitation":  "Alafasy_128kbps/046027",
        "Body":  "We have destroyed the towns which were once flourished around you\n\t\t\t- and We repeatedly sent them Our revelations so that they may\n\t\t\tturn to the Right Way."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "46",
        "AyahNumber":  "28",
        "Recitation":  "Alafasy_128kbps/046028",
        "Body":  "- Then Why did not those whom they worshipped besides Allah\n\t\t\thelped them who they regarded as a means of attaining nearness to\n\t\t\tHim? But those deities utterly forsake them, because those were\n\t\t\tnothing but their lies and their false inventions."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "46",
        "AyahNumber":  "29",
        "Recitation":  "Alafasy_128kbps/046029",
        "Body":  "Tell them how We brought to you a group of jinns, who when they\n\t\t\treached the place where you were reciting and listened to the\n\t\t\tQur\u0027an, said to each other: \"Be silent.\" When the recitation was\n\t\t\tover, they returned to their people as warners."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "46",
        "AyahNumber":  "3",
        "Recitation":  "Alafasy_128kbps/046003",
        "Body":  "We created the heavens and the earth and all that lies between\n\t\t\tthem to manifest the truth and to last for an appointed term. Yet\n\t\t\tthe disbelievers give no heed to Our warning."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "46",
        "AyahNumber":  "30",
        "Recitation":  "Alafasy_128kbps/046030",
        "Body":  "They said \"O our people! We have just listened to a Book that has\n\t\t\tbeen revealed after Musa which is confirming that what came\n\t\t\tbefore it, and it guides to the truth and to the Right Way."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "46",
        "AyahNumber":  "31",
        "Recitation":  "Alafasy_128kbps/046031",
        "Body":  "O our people, answer the one who is calling you towards Allah and\n\t\t\tbelieve in him! Allah will forgive you your sins and save you\n\t\t\tfrom a painful punishment."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "46",
        "AyahNumber":  "32",
        "Recitation":  "Alafasy_128kbps/046032",
        "Body":  "He that does not answer the one who is calling towards Allah,\n\t\t\tshall neither escape in the earth, nor shall have any to protect\n\t\t\tfrom Him. Surely such people are in manifest error.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "46",
        "AyahNumber":  "33",
        "Recitation":  "Alafasy_128kbps/046033",
        "Body":  "Do they not see that Allah, Who created the heavens and the earth\n\t\t\tand was not wearied by their creation, has the power to raise the\n\t\t\tdead to life? Why not! Surely He has the power over everything."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "46",
        "AyahNumber":  "34",
        "Recitation":  "Alafasy_128kbps/046034",
        "Body":  "On the Day when the unbelievers will be brought before the fire,\n\t\t\tAllah will ask: \"Is this not real?\" \"Yes, by our Rabb!\" They will\n\t\t\tanswer. \"Well, then taste the punishment now,\" Will He reply, \"in\n\t\t\tconsequence of your disbelieve.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "46",
        "AyahNumber":  "35",
        "Recitation":  "Alafasy_128kbps/046035",
        "Body":  "Therefore, bear with them with patience, as did the Rasools\n\t\t\tendowed with firmness of purpose before you, and do not be in\n\t\t\thaste about them. On the Day when they shall see that which they\n\t\t\tare being threatened with, their life on earth will seem to them\n\t\t\tas if they had lived no more than an hour of a day. The Message\n\t\t\tof forewarning has been conveyed. Shall any be destroyed except\n\t\t\tthe transgressors?"
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "46",
        "AyahNumber":  "4",
        "Recitation":  "Alafasy_128kbps/046004",
        "Body":  "Ask them: \"Have you pondered on those whom you invoke besides\n\t\t\tAllah? Show me anything that they have created in the earth, or\n\t\t\tdo they have any share in the creation of the heavens? Bring me\n\t\t\tany Book revealed before this, or some remnant of divine\n\t\t\tknowledge in support of your beliefs if you are telling the\n\t\t\ttruth.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "46",
        "AyahNumber":  "5",
        "Recitation":  "Alafasy_128kbps/046005",
        "Body":  "And who could be more astray than the one who invokes those\n\t\t\tdeities besides Allah who cannot answer him till the Day of\n\t\t\tResurrection - which, in fact, are not even aware that they are\n\t\t\tbeing invoked?"
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "46",
        "AyahNumber":  "6",
        "Recitation":  "Alafasy_128kbps/046006",
        "Body":  "And when mankind shall be assembled on the Day of Judgement, they\n\t\t\twill become enemies of those who invoked them and deny their\n\t\t\tworship altogether."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "46",
        "AyahNumber":  "7",
        "Recitation":  "Alafasy_128kbps/046007",
        "Body":  "When Our revelations are recited to them, clear as they are, and\n\t\t\tthe truth comes before them, the disbelievers say: \"This is plain\n\t\t\tmagic.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "46",
        "AyahNumber":  "8",
        "Recitation":  "Alafasy_128kbps/046008",
        "Body":  "Do they say that the Prophet has fabricated it himself? O\n\t\t\tProphet, tell them: \"If I have fabricated it myself, then there\n\t\t\tis nothing that you can do to protect me from the wrath of Allah.\n\t\t\tHe knows fully well what you say about it. Enough is He as a\n\t\t\twitness between me and you. He is the Oft-Forgiving, the Most\n\t\t\tMerciful.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "46",
        "AyahNumber":  "9",
        "Recitation":  "Alafasy_128kbps/046009",
        "Body":  "O Prophet tell them: \"I am no prodigy among the Rasools; nor do I\n\t\t\tknow what will be done with me or with you. I follow only what is\n\t\t\trevealed to me, and I am no more than a plain Warner.\""
    }
]
