[
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "1",
        "Recitation":  "Alafasy_128kbps/003001",
        "Body":  "Alif Lam M\u0027im"
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "10",
        "Recitation":  "Alafasy_128kbps/003010",
        "Body":  "Surely neither their wealth nor their children will save the\n\t\t\tunbelievers from the wrath of Allah: they are the ones who will\n\t\t\tbecome the fuel for Hell fire."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "100",
        "Recitation":  "Alafasy_128kbps/003100",
        "Body":  "O believers! If you were to obey a group of those who were given\n\t\t\tthe Book, they will turn you back from belief to unbelief."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "101",
        "Recitation":  "Alafasy_128kbps/003101",
        "Body":  "Just think, how can you turn away from belief on their\n\t\t\tstatements, when Allah\u0027s revelations are being recited to you and\n\t\t\tAllah\u0027s Rasool is among you? Whoever holds fast to Allah, will\n\t\t\tindeed be guided towards the Right Way."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "102",
        "Recitation":  "Alafasy_128kbps/003102",
        "Body":  "O believers! Fear Allah as He should be feared and die not but as\n\t\t\ttrue Muslims."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "103",
        "Recitation":  "Alafasy_128kbps/003103",
        "Body":  "All together hold fast the rope of Allah (Faith of Islam) and be\n\t\t\tnot divided among yourselves. Remember Allah\u0027s favors upon you\n\t\t\twhen you were enemies; He united your hearts, so by His favor you\n\t\t\tbecame brethren; you were at the brink of the fiery pit and He\n\t\t\tsaved you from it. Thus Allah makes His revelations clear to you,\n\t\t\tso that you may be rightly guided."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "104",
        "Recitation":  "Alafasy_128kbps/003104",
        "Body":  "Let there arise from among you a band of people who should invite\n\t\t\tto righteousness, enjoin good and forbid evil; such are the ones\n\t\t\twho shall be successful."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "105",
        "Recitation":  "Alafasy_128kbps/003105",
        "Body":  "Be not like those who became divided into sects and who started\n\t\t\tto argue against each other after clear revelations had come to\n\t\t\tthem. Those responsible for division and arguments will be\n\t\t\tsternly punished"
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "106",
        "Recitation":  "Alafasy_128kbps/003106",
        "Body":  "on the Day when some faces will be brightened with joy and others\n\t\t\tdarkened with gloom. To the dark-faced sinner it will be said:\n\t\t\t\"Did you adopt the way of disbelief after embracing the True\n\t\t\tFaith? Then taste the punishment for having adopted the way of\n\t\t\tdisbelief.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "107",
        "Recitation":  "Alafasy_128kbps/003107",
        "Body":  "As for the bright-faced ones, they will be in Allah\u0027s Mercy and\n\t\t\tabide therein forever."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "108",
        "Recitation":  "Alafasy_128kbps/003108",
        "Body":  "These are the Revelations of Allah, We recite them to you in\n\t\t\ttruth; Allah intends no injustice to the worlds."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "109",
        "Recitation":  "Alafasy_128kbps/003109",
        "Body":  "All that is in the heavens and in the earth belongs to Allah and\n\t\t\tall matters return to Allah for decision."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "11",
        "Recitation":  "Alafasy_128kbps/003011",
        "Body":  "Their end will be the same as that of the people of Fir\u0027on\n\t\t\t(Pharaoh) and their predecessors who denied Our revelations, so\n\t\t\tAllah called them to account for their sins. Allah is strict in\n\t\t\tretribution."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "110",
        "Recitation":  "Alafasy_128kbps/003110",
        "Body":  "You are the best nation which has ever been raised for the\n\t\t\tguidance of mankind. You enjoin good, forbid evil, and believe in\n\t\t\tAllah. Had the People of the Book (Jews and Christians) believed,\n\t\t\tit would surely have been better for them; among them some are\n\t\t\tbelievers but most of them are transgressors."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "111",
        "Recitation":  "Alafasy_128kbps/003111",
        "Body":  "Anyhow, they can do no harm to you except a trifling annoyance;\n\t\t\tif they do fight against you, they will turn their backs and run,\n\t\t\tgetting no help from anywhere."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "112",
        "Recitation":  "Alafasy_128kbps/003112",
        "Body":  "Disgrace will be branded on them wherever they are found except\n\t\t\twhen they get refuge under the favor of Allah or the patronage of\n\t\t\tother people; they have incurred the wrath of Allah and have been\n\t\t\tbranded with misery because they disbelieved Allah\u0027s revelations\n\t\t\tand slew His prophets unjustly and because they disobeyed and\n\t\t\ttransgressed the limits."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "113",
        "Recitation":  "Alafasy_128kbps/003113",
        "Body":  "Yet they are not all alike: there are some among the People of\n\t\t\tthe Book who are upright, who recite the revelations of Allah all\n\t\t\tnight long and then prostrate before Him;"
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "114",
        "Recitation":  "Alafasy_128kbps/003114",
        "Body":  "they believe in Allah and the Last Day they enjoin good and\n\t\t\tforbid evil and rush in emulating each other in good deeds. These\n\t\t\tare the righteous people."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "115",
        "Recitation":  "Alafasy_128kbps/003115",
        "Body":  "Whatever good they do, its reward will not be denied to them;\n\t\t\tAllah knows the righteous."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "116",
        "Recitation":  "Alafasy_128kbps/003116",
        "Body":  "Surely for those who are unbelievers, neither their wealth nor\n\t\t\ttheir children shall in the least protect them from the wrath of\n\t\t\tAllah; they will be the inmates of hellfire and live therein\n\t\t\tforever."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "117",
        "Recitation":  "Alafasy_128kbps/003117",
        "Body":  "What they spend in this life (hypocritical charity) may be\n\t\t\tcompared to a freezing wind which strikes and destroys the\n\t\t\ttillage of people who have wronged themselves (it is the lack of\n\t\t\tfaith which makes their reward null and void); Allah is not\n\t\t\tunjust to them; it is they who have done injustice to their own\n\t\t\tsouls."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "118",
        "Recitation":  "Alafasy_128kbps/003118",
        "Body":  "O believers! Do not make intimate friendships with any but with\n\t\t\tyour own people. The unbelievers will not miss any opportunity to\n\t\t\tcorrupt you. They desire nothing but your destruction: their\n\t\t\tmalice has become evident from what they say; and what they\n\t\t\tconceal in their hearts is far worse. We have made Our\n\t\t\trevelations plain to you, if you do want to comprehend."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "119",
        "Recitation":  "Alafasy_128kbps/003119",
        "Body":  "Whereas you love them, they do not love you even though you\n\t\t\tbelieve in their Holy Books (the Psalms, the Torah, and the\n\t\t\tGospels). When they meet you they say \"We also believe in your\n\t\t\tprophet and your Qur\u0027an;\" but when they are alone they bite their\n\t\t\tfingertips in rage against you. Say to them: \"May you perish in\n\t\t\tyour rage;\" surely Allah knows all the secrets of the heart."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "12",
        "Recitation":  "Alafasy_128kbps/003012",
        "Body":  "O Muhammad, say to the unbelievers: \"Soon you will be overpowered\n\t\t\tand driven together to Hell - which is a horrible refuge."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "120",
        "Recitation":  "Alafasy_128kbps/003120",
        "Body":  "When you are blessed with good fortune they grieve; but if some\n\t\t\tmisfortune overtakes you they rejoice. If you are patient and\n\t\t\tguard yourself against evil, their schemes will not harm you in\n\t\t\tany way. Surely Allah encompasses all their actions."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "121",
        "Recitation":  "Alafasy_128kbps/003121",
        "Body":  "O Muhammad, remember that morning when you left your household at\n\t\t\tan early hour to assign the believers to their battle-posts (in\n\t\t\tthe battle of Uhud): Allah hears and knows everything."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "122",
        "Recitation":  "Alafasy_128kbps/003122",
        "Body":  "Remember when two of your companies became fainthearted and Allah\n\t\t\tprotected them through strengthening their hearts. In Allah\n\t\t\tshould the believers put their trust."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "123",
        "Recitation":  "Alafasy_128kbps/003123",
        "Body":  "Allah helped you at the battle of Badr when you were helpless.\n\t\t\tTherefore, have fear of Allah; perhaps you may become thankful."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "124",
        "Recitation":  "Alafasy_128kbps/003124",
        "Body":  "Remember when you said to the believers, \"Is it not enough that\n\t\t\tAllah should send down three thousand angels to help you?\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "125",
        "Recitation":  "Alafasy_128kbps/003125",
        "Body":  "Of course! If you remain patient and on your guard, Allah will\n\t\t\tsend to your aid not three thousand but, five thousand specially\n\t\t\tmarked angels in case of a sudden attack from the enemy."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "126",
        "Recitation":  "Alafasy_128kbps/003126",
        "Body":  "Allah has told you this as a good news and that your hearts may\n\t\t\tbe at ease thereby; victory comes only from Allah, the Mighty,\n\t\t\tthe Wise."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "127",
        "Recitation":  "Alafasy_128kbps/003127",
        "Body":  "( Allah sent the aid of Angels for the believers to offset the\n\t\t\taid of Shaitans to the unbelievers) so that He might cut off a\n\t\t\tflank of the unbelievers or put them to flight, making them\n\t\t\twithdraw with utter disappointment."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "128",
        "Recitation":  "Alafasy_128kbps/003128",
        "Body":  "O Prophet, you have no authority to decide the affair; it is up\n\t\t\tto Allah whether He pardon or punish them since they are\n\t\t\twrongdoers."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "129",
        "Recitation":  "Alafasy_128kbps/003129",
        "Body":  "To Allah belongs all that is in the Heavens and in the earth. He\n\t\t\tpardons whom He pleases and punishes whom He pleases. Allah is\n\t\t\tForgiving, Merciful."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "13",
        "Recitation":  "Alafasy_128kbps/003013",
        "Body":  "Indeed there was a sign (lesson) for you in the two armies which\n\t\t\tmet on the battlefield (of Badr): one was fighting for the cause\n\t\t\tof Allah and the other had rejected Allah; the believers saw with\n\t\t\ttheir own eyes that the unbelievers were twice their number. But\n\t\t\tthe result of the battle proved that Allah strengthens with His\n\t\t\town aid whom He pleases. Surely there is a lesson in this for\n\t\t\tthose who have sight."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "130",
        "Recitation":  "Alafasy_128kbps/003130",
        "Body":  "O believers! Do not live on usury (compound interest) which is\n\t\t\tcompounded over and over again. Have fear of Allah so that you\n\t\t\tmay prosper."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "131",
        "Recitation":  "Alafasy_128kbps/003131",
        "Body":  "Guard yourself against the Fire which is prepared for the\n\t\t\tunbelievers."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "132",
        "Recitation":  "Alafasy_128kbps/003132",
        "Body":  "Obey Allah and His Rasool so that you may find mercy."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "133",
        "Recitation":  "Alafasy_128kbps/003133",
        "Body":  "Rush towards the forgiveness from your Rabb to a Paradise as vast\n\t\t\tas the Heavens and the earth which is prepared for the righteous\n\t\t\tpeople;"
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "134",
        "Recitation":  "Alafasy_128kbps/003134",
        "Body":  "they are those who spend generously in the way of Allah, whether\n\t\t\tthey are in prosperity or in adversity, who control their anger\n\t\t\tand forgive other people for Allah loves such charitable people,"
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "135",
        "Recitation":  "Alafasy_128kbps/003135",
        "Body":  "who, if they commit an indecency or wrong their own souls,\n\t\t\tearnestly remember Allah and seek forgiveness for their sins; for\n\t\t\tno one can forgive sins except Allah, and those who do not\n\t\t\tknowingly persist in something wrong which they have done."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "136",
        "Recitation":  "Alafasy_128kbps/003136",
        "Body":  "Such people will be rewarded with forgiveness from their Rabb\n\t\t\tplus gardens beneath which the rivers flow, to live therein\n\t\t\tforever. How excellent is the reward for such laborers!"
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "137",
        "Recitation":  "Alafasy_128kbps/003137",
        "Body":  "As for those who rejected the Divine Revelations, there have been\n\t\t\tmany examples before you; therefore, travel through the earth and\n\t\t\tsee what was the end of those who rejected the truth."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "138",
        "Recitation":  "Alafasy_128kbps/003138",
        "Body":  "This (Al-Qur\u0027an) is a clear declaration to mankind, a guidance\n\t\t\tand an admonition to those who fear Allah!"
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "139",
        "Recitation":  "Alafasy_128kbps/003139",
        "Body":  "Do not grieve and get disheartened: for you will have the upper\n\t\t\thand if you are the believers."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "14",
        "Recitation":  "Alafasy_128kbps/003014",
        "Body":  "The life of men when they get to the age of puberty is tempted by\n\t\t\tdesire for women when they get married children, when they get\n\t\t\tchildren the hoarding of treasures of gold and silver, splendid\n\t\t\thorses, cattle, and plantations. These are the comforts for the\n\t\t\ttransitory life of this world; the everlasting best comfort,\n\t\t\thowever, is with Allah."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "140",
        "Recitation":  "Alafasy_128kbps/003140",
        "Body":  "If you have suffered a wound, so did the enemy. We alternate\n\t\t\tthese days of varying fortunes among mankind so that Allah may\n\t\t\tknow the true believers and take witnesses to the truth (grant\n\t\t\tmartyrdom) from among you, for Allah does not love the unjust\n\t\t\tpeople,"
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "141",
        "Recitation":  "Alafasy_128kbps/003141",
        "Body":  "and that Allah may purge the believers and annihilate the\n\t\t\tunbelievers."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "142",
        "Recitation":  "Alafasy_128kbps/003142",
        "Body":  "Do you think that you will enter paradise without going through\n\t\t\tthe trial? Allah has not yet tested you to see who among you\n\t\t\tstrive hard for His cause and who show patience for His sake."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "143",
        "Recitation":  "Alafasy_128kbps/003143",
        "Body":  "You certainly used to wish for death before you confronted it;\n\t\t\tnow you have seen with your own eyes what it is like."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "144",
        "Recitation":  "Alafasy_128kbps/003144",
        "Body":  "Muhammad is no more than a Rasool of Allah, like the Rasools that\n\t\t\tpassed away before him. If he dies or is killed will you turn\n\t\t\tback on your heels (become unbelievers)? He that turns back on\n\t\t\this heels will do no harm to Allah; but Allah will reward the\n\t\t\tthankful."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "145",
        "Recitation":  "Alafasy_128kbps/003145",
        "Body":  "No one dies without the permission of Allah. The term of every\n\t\t\tlife is fixed. He that desires the reward in this world shall be\n\t\t\tgiven it here, and he that desires the reward in the hereafter\n\t\t\tshall be given it there. Soon We will reward the thankful."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "146",
        "Recitation":  "Alafasy_128kbps/003146",
        "Body":  "In the past many Prophets have fought, in the way of Allah, with\n\t\t\ta large number of godly people. They did not loose heart during\n\t\t\tthe adversities that befell them in the path of Allah; they\n\t\t\tneither showed weakness nor submitted to falsehood. Allah loves\n\t\t\tthe steadfast."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "147",
        "Recitation":  "Alafasy_128kbps/003147",
        "Body":  "Their only words were, \"Our Rabb! Forgive our sins and our\n\t\t\texcesses; establish our feet firmly and give us victory over the\n\t\t\tunbelievers.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "148",
        "Recitation":  "Alafasy_128kbps/003148",
        "Body":  "Therefore, Allah gave them the reward in this world and also an\n\t\t\texcellent reward awaits them in the Hereafter. Allah loves the\n\t\t\trighteous who are good to others."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "149",
        "Recitation":  "Alafasy_128kbps/003149",
        "Body":  "O believers! If you yield to the unbelievers they will drag you\n\t\t\tback to unbelief and you will become the losers."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "15",
        "Recitation":  "Alafasy_128kbps/003015",
        "Body":  "Say : \"Shall I tell you of better things than these, with which\n\t\t\tthe righteous will be rewarded by their Rabb? There will be\n\t\t\tgardens beneath which rivers flow, where they will live forever\n\t\t\twith spouses of perfect chastity and the good pleasure of Allah.\n\t\t\tAllah is watching His servants very closely.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "150",
        "Recitation":  "Alafasy_128kbps/003150",
        "Body":  "The fact is that Allah is your Protector and He is the best of\n\t\t\tall helpers."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "151",
        "Recitation":  "Alafasy_128kbps/003151",
        "Body":  "Soon We shall cast terror into the hearts of the unbelievers for\n\t\t\tthey commit shirk with Allah, for whom He has revealed no\n\t\t\tauthority. The hellfire shall be their home; and evil is the home\n\t\t\tof the wrongdoers."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "152",
        "Recitation":  "Alafasy_128kbps/003152",
        "Body":  "Allah did indeed fulfil His promise to you when with His leave\n\t\t\tyou defeated them, until you flinched and fell into dispute about\n\t\t\tthe order and disobeyed the Prophet, after Allah had brought it\n\t\t\twithin your sight the booty which you loved. Among you there were\n\t\t\tsome who desired the gain of this world and some who desired the\n\t\t\tgain of the Hereafter. He allowed you to be defeated in order to\n\t\t\ttest you, but now He has forgiven you, for Allah is gracious to\n\t\t\tthe believers."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "153",
        "Recitation":  "Alafasy_128kbps/003153",
        "Body":  "Remember how you fled in panic and did not even look back at one\n\t\t\tanother while the Rasool, at your rear, was calling out to you!\n\t\t\tConsequently, Allah inflicted upon you one sorrow after another\n\t\t\tto teach you a lesson: not to grieve for what you lose nor at any\n\t\t\tmisfortune you may encounter. Allah is well aware of all that you\n\t\t\tdo."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "154",
        "Recitation":  "Alafasy_128kbps/003154",
        "Body":  "Then after this grief, He bestowed peace on some of you - a\n\t\t\tslumber which overcame them - while the others were stirred to\n\t\t\tanxiety by their own fancies, holding unjust and wrong suspicions\n\t\t\tabout Allah, the suspicions of ignorance. Now they ask: \"Have we\n\t\t\tany say in the matter?\" Tell them: \"All matters are in the hands\n\t\t\tof Allah.\" They hide in their minds what they dare not reveal to\n\t\t\tyou. They mean to say: \"If we had any say in the matter, none of\n\t\t\tus would have been killed here.\" Say to them: \"Even if you had\n\t\t\tremained in your homes, those of you who were destined to be\n\t\t\tkilled would nevertheless have been killed; but it was Allah\u0027s\n\t\t\twill to test your faith and purge what was in your hearts. Allah\n\t\t\thas knowledge of the secrets of your hearts.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "155",
        "Recitation":  "Alafasy_128kbps/003155",
        "Body":  "As for those of you who turned their backs on the day when the\n\t\t\ttwo armies met, they failed in their duty because they were\n\t\t\tseduced by Shaitan on account of some of their shortcomings. But\n\t\t\tnow Allah has pardoned them; for Allah is Forgiving, Forbearing."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "156",
        "Recitation":  "Alafasy_128kbps/003156",
        "Body":  "O believers! Do not be like the unbelievers who speak of those\n\t\t\tbrethren of theirs who die during their travels on the earth or\n\t\t\twhile engaged in fighting: \"Had they but stayed with us they\n\t\t\twould not have died or been killed.\" Allah makes such thinking a\n\t\t\tcause of regret and anguish in their hearts. It is Allah who\n\t\t\tgives life and death. Allah is observant of all your actions."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "157",
        "Recitation":  "Alafasy_128kbps/003157",
        "Body":  "If you should die or get killed in the cause of Allah, His\n\t\t\tforgiveness and mercy will be far better than all the riches you\n\t\t\tcould gather."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "158",
        "Recitation":  "Alafasy_128kbps/003158",
        "Body":  "Whether you die or get killed, all of you will be brought before\n\t\t\tAllah."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "159",
        "Recitation":  "Alafasy_128kbps/003159",
        "Body":  "O Muhammad, it is a great Mercy of Allah that you are very gentle\n\t\t\twith them; had you been rough or hard-hearted, they would have\n\t\t\tdeserted you. Therefore pardon them and ask Allah\u0027s forgiveness\n\t\t\tfor them. Consult them in the conduct of affairs; and when you\n\t\t\tmake a decision to do something, then put your trust in Allah\n\t\t\t(hold fast to your decision). Allah loves those who put their\n\t\t\ttrust in Him."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "16",
        "Recitation":  "Alafasy_128kbps/003016",
        "Body":  "The righteous people are those who pray: \"Our Rabb! We sincerely\n\t\t\tbelieve in You: please forgive our sins and save us from the\n\t\t\tagony of the Hellfire;\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "160",
        "Recitation":  "Alafasy_128kbps/003160",
        "Body":  "If Allah helps you, then there is none who can overcome you. If\n\t\t\tHe forsakes you, then who else is there other than Him who can\n\t\t\thelp you? Therefore, In Allah let the believers put their trust."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "161",
        "Recitation":  "Alafasy_128kbps/003161",
        "Body":  "It is not conceivable that any Prophet would hold back from the\n\t\t\tspoils of war; for anyone who holds back shall bring along\n\t\t\twhatever he has been withholding on the Day of Resurrection; then\n\t\t\tevery soul shall be paid back in full what it has earned and they\n\t\t\tshall not be dealt with unjustly."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "162",
        "Recitation":  "Alafasy_128kbps/003162",
        "Body":  "Can it be conceivable that a person who is seeking the good\n\t\t\tpleasure of Allah will behave like the one who has incurred the\n\t\t\twrath of Allah and is ultimately doomed to Hell, which is an evil\n\t\t\trefuge?"
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "163",
        "Recitation":  "Alafasy_128kbps/003163",
        "Body":  "These two kinds of people have quite different levels in the\n\t\t\tsight of Allah; Allah is observant of all their actions."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "164",
        "Recitation":  "Alafasy_128kbps/003164",
        "Body":  "Allah has done a great favor to the believers that He raised\n\t\t\tamong them a Rasool from among themselves, reciting to them the\n\t\t\tRevelations of Allah, sanctifying them and teaching them the Book\n\t\t\tand Wisdom, although before this they were in manifest error."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "165",
        "Recitation":  "Alafasy_128kbps/003165",
        "Body":  "How is it that when you are afflicted with a loss, after you\n\t\t\tyourselves had inflicted losses twice as heavy upon your enemy in\n\t\t\tthe battle of Badr, you exclaimed: \"Whose fault was that?\" Say to\n\t\t\tthem: \"It was your own fault,\" Allah has power over everything."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "166",
        "Recitation":  "Alafasy_128kbps/003166",
        "Body":  "The misfortune which befell you when the two armies met in the\n\t\t\tbattle of Uhud was with the leave of Allah, so that He might know\n\t\t\tthe true believers"
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "167",
        "Recitation":  "Alafasy_128kbps/003167",
        "Body":  "and the hypocrites. When it was said to them (hypocrites): \"Come\n\t\t\tfight for the cause of Allah or at least defend yourselves,\" they\n\t\t\treplied: \"Had we known how to fight we would certainly come with\n\t\t\tyou.\" On that day they were nearer to unbelief than to belief;\n\t\t\tfor they uttered with their mouths what was not in their hearts.\n\t\t\tAllah is quite aware of what they were concealing."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "168",
        "Recitation":  "Alafasy_128kbps/003168",
        "Body":  "Such are the ones who, as they sat at home, said of their\n\t\t\tbrothers: \"Had they listened to us, they would not have been\n\t\t\tkilled.\" Ask them: \"Avert death from your own selves, when it\n\t\t\tcomes to you, if you speak the truth.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "169",
        "Recitation":  "Alafasy_128kbps/003169",
        "Body":  "Never think of those who are slain in the cause of Allah as dead.\n\t\t\tNay they are alive, and well provided for by their Rabb;"
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "17",
        "Recitation":  "Alafasy_128kbps/003017",
        "Body":  "who are steadfast, sincere, obedient, and charitable, and who\n\t\t\tpray for forgiveness in the morning time."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "170",
        "Recitation":  "Alafasy_128kbps/003170",
        "Body":  "they are pleased with what Allah has given them and they are also\n\t\t\thappy to think that there is nothing to fear or to regret for\n\t\t\tthose believers whom they have left behind and who have not yet\n\t\t\tjoined them in their bliss."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "171",
        "Recitation":  "Alafasy_128kbps/003171",
        "Body":  "They feel happy to have received Allah\u0027s grace and bounty and\n\t\t\thave come to know that most surely Allah does not waste the\n\t\t\treward of the believers."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "172",
        "Recitation":  "Alafasy_128kbps/003172",
        "Body":  "As for those, who, even after their injuries during the battle of\n\t\t\tUhud, responded to the call of Allah and His Rasool to follow the\n\t\t\tQureysh army which was gathering to attack again, there will be a\n\t\t\tgreat reward for such of those who do righteous deeds and refrain\n\t\t\tfrom evil,"
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "173",
        "Recitation":  "Alafasy_128kbps/003173",
        "Body":  "and who, when the people told them: \"Your enemies have mustered a\n\t\t\tgreat force against you: fear them,\" grew more firm in their\n\t\t\tfaith and replied: \"Allah\u0027s help is all-sufficient for us. He is\n\t\t\tthe best protector.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "174",
        "Recitation":  "Alafasy_128kbps/003174",
        "Body":  "As a result they returned home with blessings and grace from\n\t\t\tAllah and suffered no harm at all. Besides this, they had the\n\t\t\thonor of following what pleased Allah, and Allah is the Owner of\n\t\t\tmighty grace."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "175",
        "Recitation":  "Alafasy_128kbps/003175",
        "Body":  "Now you must have realized that it was the Shaitan who was trying\n\t\t\tto prompt you to fear his followers. But have no fear of them.\n\t\t\tFear Me, if you are true believers."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "176",
        "Recitation":  "Alafasy_128kbps/003176",
        "Body":  "O Muhammad, let not those who rush headlong into unbelief grieve\n\t\t\tyou; surely they can do absolutely no harm to Allah. Allah\n\t\t\tintends to give them no share in the Hereafter. They shall have a\n\t\t\tgrievous punishment."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "177",
        "Recitation":  "Alafasy_128kbps/003177",
        "Body":  "Those who barter away faith for unbelief will in no way harm\n\t\t\tAllah. They shall have a painful punishment."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "178",
        "Recitation":  "Alafasy_128kbps/003178",
        "Body":  "Let not the Unbelievers think that Our granting of respite is\n\t\t\tgood for their souls. We grant them respite so that they may add\n\t\t\tmore to their sins. They shall have a disgraceful punishment."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "179",
        "Recitation":  "Alafasy_128kbps/003179",
        "Body":  "Allah will not leave the believers in their present condition;\n\t\t\tyou are in this condition only until He separates the Evil from\n\t\t\tthe Good. Allah will not do this by disclosing to you the secrets\n\t\t\tof the unseen. As for disclosing the unseen, Allah chooses those\n\t\t\tof his Rasools whom He pleases. Therefore, believe in Allah and\n\t\t\tHis Rasool. If you have faith and guard yourselves against evil,\n\t\t\tyou shall have a great reward."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "18",
        "Recitation":  "Alafasy_128kbps/003018",
        "Body":  "Allah Himself has testified to the fact that there is no god but\n\t\t\tHim and so do the angels and those who are well grounded in\n\t\t\tknowledge standing firm on justice. There is no Ilah (God) except\n\t\t\tHim, the Mighty, the Wise."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "180",
        "Recitation":  "Alafasy_128kbps/003180",
        "Body":  "Let not those who are niggardly in giving for charity from what\n\t\t\tAllah has blessed them with, think that it is good for them: nay\n\t\t\tit is very bad for them. All the wealth they hoarded with\n\t\t\tniggardly behavior will be hung around their necks like a collar\n\t\t\ton the Day of Resurrection. It is Allah who will inherit the\n\t\t\theavens and the earth. Allah is well aware of all your actions."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "181",
        "Recitation":  "Alafasy_128kbps/003181",
        "Body":  "Allah has heard the statement of those who said: \" Allah is poor\n\t\t\tand we are rich!\" Their words are recorded and so is their unjust\n\t\t\tkillings of the Prophets.\" On the Day of Judgement, We shall say:\n\t\t\t\"Taste now the torment of burning!"
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "182",
        "Recitation":  "Alafasy_128kbps/003182",
        "Body":  "Here is the reward of your misdeeds. Allah is not unjust to His\n\t\t\tservants.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "183",
        "Recitation":  "Alafasy_128kbps/003183",
        "Body":  "They also claim: \"Allah has commanded us to believe in no Rasool\n\t\t\tunless he shows us a sacrifice consumed by a fire from the\n\t\t\tHeaven.\" Ask them: \"Other prophets before me have come to you\n\t\t\twith clear arguments and showed this miracle you are asking for.\n\t\t\tWhy did you kill them if what you say is true?\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "184",
        "Recitation":  "Alafasy_128kbps/003184",
        "Body":  "O Muhammad if they reject you by calling you an impostor, so did\n\t\t\tthey reject other Rasools before you, although they brought them\n\t\t\tclear signs, Psalms, and the enlightening Book."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "185",
        "Recitation":  "Alafasy_128kbps/003185",
        "Body":  "Every soul shall taste death. You shall receive your full reward\n\t\t\tfor everything which you have striven for, on the Day of\n\t\t\tResurrection. Whoever is spared from the fire and is admitted\n\t\t\tinto paradise will have attained the objective of this worldly\n\t\t\tlife; for the life of this world is nothing but an illusory\n\t\t\tenjoyment."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "186",
        "Recitation":  "Alafasy_128kbps/003186",
        "Body":  "You shall certainly be tested with by means of your wealth and\n\t\t\twith your persons; and you will certainly hear much that is\n\t\t\thurtful from those who were given the Book before you, and from\n\t\t\tthe mushrikin. But if you endure with patience and have fear of\n\t\t\tAllah, this will surely be a proof of your firm determination."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "187",
        "Recitation":  "Alafasy_128kbps/003187",
        "Body":  "When Allah made the covenant with those who were given the Book,\n\t\t\tthey were asked to spread the teachings of the Book to mankind\n\t\t\tand not to conceal them; but they cast it behind their backs and\n\t\t\tsold them for a petty price. What a bad bargain they made!"
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "188",
        "Recitation":  "Alafasy_128kbps/003188",
        "Body":  "Those who rejoice in their misdeeds and wish to be praised for\n\t\t\twhat they have not actually done, should never think that they\n\t\t\twill escape the punishment; in fact they shall have a painful\n\t\t\tpunishment;"
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "189",
        "Recitation":  "Alafasy_128kbps/003189",
        "Body":  "for all the dominions of the Heavens and the earth belong to\n\t\t\tAllah Who has power over everything."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "19",
        "Recitation":  "Alafasy_128kbps/003019",
        "Body":  "Surely the only Deen (true religion and the Right Way of life) in\n\t\t\tthe sight of Allah is Al-Islam: Those to whom the Book was given\n\t\t\tdid not adopt ways different than this except out of envy among\n\t\t\tthemselves, and after the true knowledge had come to them. They\n\t\t\tshould know that Allah is swift in calling to account those who\n\t\t\tdeny His revelations."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "190",
        "Recitation":  "Alafasy_128kbps/003190",
        "Body":  "For sure, in the creation of the heavens and the earth and the\n\t\t\talternation of the night and the day there are signs for men of\n\t\t\tunderstanding."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "191",
        "Recitation":  "Alafasy_128kbps/003191",
        "Body":  "Those who remember Allah while standing, sitting, and lying on\n\t\t\ttheir sides, and meditate on the creation of the heavens and the\n\t\t\tearth. Then cry out:\" Our Rabb! You have not created this in\n\t\t\tvain. Glory to You! Save us from the punishment of Fire."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "192",
        "Recitation":  "Alafasy_128kbps/003192",
        "Body":  "Our Rabb! Those to whom You will cast into the Fire will be in\n\t\t\teternal shame: and there shall be no helper for such wrongdoers."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "193",
        "Recitation":  "Alafasy_128kbps/003193",
        "Body":  "Our Rabb! We have heard someone calling to the true faith saying;\n\t\t\t\u0027Believe in your Rabb,\u0027 so we have believed. Our Rabb! Forgive us\n\t\t\tour sins, remove from us our evil deeds and make us die with the\n\t\t\trighteous."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "194",
        "Recitation":  "Alafasy_128kbps/003194",
        "Body":  "Our Rabb! Grant us what You have promised through Your Rasools\n\t\t\tand save us from the shame on the Day of Resurrection; for You\n\t\t\tnever break Your promise.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "195",
        "Recitation":  "Alafasy_128kbps/003195",
        "Body":  "So their Rabb answers their prayers, saying: \" I will not let the\n\t\t\tgood deed of any worker among you, whether a male or a female, be\n\t\t\twasted. You are the offspring of one another. Those who had to\n\t\t\tleave their homes or were expelled therefrom, and those who\n\t\t\tsuffered persecution for My sake and fought and were killed: I\n\t\t\twill forgive them their sins and admit them into gardens beneath\n\t\t\twhich the rivers flow; a prize from Allah, and Allah holds the\n\t\t\tfinest prize!\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "196",
        "Recitation":  "Alafasy_128kbps/003196",
        "Body":  "Do not be deceived by the free movement of the unbelievers in\n\t\t\tthis land."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "197",
        "Recitation":  "Alafasy_128kbps/003197",
        "Body":  "Their enjoyment is brief. Their ultimate home shall be Hell, an\n\t\t\tevil refuge."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "198",
        "Recitation":  "Alafasy_128kbps/003198",
        "Body":  "As for those who fear their Rabb, there shall be gardens beneath\n\t\t\twhich the rivers flow, they will live therein forever, this will\n\t\t\tbe their welcome from Allah; and what Allah possesses is the best\n\t\t\tfor righteous people."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "199",
        "Recitation":  "Alafasy_128kbps/003199",
        "Body":  "There are some among the people of the Book who truly believe in\n\t\t\tAllah and what has been revealed to you, O Muhammad, and what has\n\t\t\tbeen revealed to them before you. They humble themselves before\n\t\t\tAllah and do not sell the revelations of Allah for a petty price.\n\t\t\tFor them, there will be a reward from their Rabb. Surely Allah is\n\t\t\tvery swift in settling the accounts."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "2",
        "Recitation":  "Alafasy_128kbps/003002",
        "Body":  "Allah! There is no god but Him; the Living, the Eternal."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "20",
        "Recitation":  "Alafasy_128kbps/003020",
        "Body":  "So if they argue with you (O Muhammad), tell them: \"I have\n\t\t\tsubmitted myself entirely to Allah and so have those who follow\n\t\t\tme.\" Then ask those who are given the Book and those who are\n\t\t\tilliterates: \"Will you also submit yourselves to Allah?\" If they\n\t\t\tbecome Muslims they shall be rightly guided but if they turn\n\t\t\tback, you need not worry, because your sole responsibility is to\n\t\t\tconvey the Message. Allah is watching all His servants very\n\t\t\tclosely."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "200",
        "Recitation":  "Alafasy_128kbps/003200",
        "Body":  "O believers! Be patient, excel in patience during confrontation,\n\t\t\thold yourselves ready for battle and have fear of Allah so that\n\t\t\tyou may succeed."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "21",
        "Recitation":  "Alafasy_128kbps/003021",
        "Body":  "Warn those who deny Allah\u0027s revelations, slay the Prophets\n\t\t\twithout any justification, and kill those from among the people\n\t\t\twho enjoin justice about the news of a painful punishment."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "22",
        "Recitation":  "Alafasy_128kbps/003022",
        "Body":  "They are the ones whose deeds will become void in this world and\n\t\t\tin the Hereafter, and they will have no helpers."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "23",
        "Recitation":  "Alafasy_128kbps/003023",
        "Body":  "Have you not seen the behavior of those (Jews) who have been\n\t\t\tgiven a portion of the Book? When they are invited to settle\n\t\t\ttheir disputes according to the Book of Allah, some of them turn\n\t\t\tback and decline."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "24",
        "Recitation":  "Alafasy_128kbps/003024",
        "Body":  "This is because they say: \"The fire of Hell shall not touch us;\n\t\t\teven if it does, it will be for a few days.\" In their religion\n\t\t\tthey are deceived by their own self-invented beliefs."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "25",
        "Recitation":  "Alafasy_128kbps/003025",
        "Body":  "What will they do when We will gather them together on the Day\n\t\t\twhich is sure to come, when every soul will be given what it has\n\t\t\tearned and there shall be no injustice?"
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "26",
        "Recitation":  "Alafasy_128kbps/003026",
        "Body":  "Say: \"O Allah! Master of all the Kingship, You give the kingdom\n\t\t\tto whom You please and take away the kingdom from whomsoever You\n\t\t\tplease; You give honor to whom You please and disgrace to whom\n\t\t\tYou please; all the good is in Your hand; surely You have power\n\t\t\tover everything."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "27",
        "Recitation":  "Alafasy_128kbps/003027",
        "Body":  "You cause the night to pass into the day and You cause the day to\n\t\t\tpass into the night; You draw the living from the dead and You\n\t\t\tdraw the dead from the living; and You provide sustenance for\n\t\t\tanyone You wish without measure.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "28",
        "Recitation":  "Alafasy_128kbps/003028",
        "Body":  "Let not the believers make unbelievers their protectors rather\n\t\t\tthan the believers; anyone who does so will have nothing to hope\n\t\t\tfor from Allah - except if you do so as a precaution to guard\n\t\t\tyourselves against their tyranny. Anyhow, Allah warns you to fear\n\t\t\tHim: because with Allah is your final refuge."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "29",
        "Recitation":  "Alafasy_128kbps/003029",
        "Body":  "Say: \"Whether you conceal what is in your heart or reveal it, it\n\t\t\tis known to Allah."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "3",
        "Recitation":  "Alafasy_128kbps/003003",
        "Body":  "He has revealed to you this Book with the Truth, confirming the\n\t\t\tscripture which preceded it, as He revealed the Taurat (Torah)\n\t\t\tand Injeel (Gospel),"
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "30",
        "Recitation":  "Alafasy_128kbps/003030",
        "Body":  "He knows whatever is in the Heavens and whatever is in the Earth.\n\t\t\tAllah has full power over everything. On the Day of Judgement,\n\t\t\twhen every soul will be confronted with whatever good it has done\n\t\t\t- as for its evil deeds, it will wish they were a long way off.\n\t\t\tAllah warns you to have His fear. Allah is full of kindness for\n\t\t\tHis devotees."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "31",
        "Recitation":  "Alafasy_128kbps/003031",
        "Body":  "Tell the people O Muhammad: \"If you sincerely love Allah, then\n\t\t\tfollow me; Allah will also love you and forgive you your sins.\n\t\t\tAllah is Forgiving, Merciful.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "32",
        "Recitation":  "Alafasy_128kbps/003032",
        "Body":  "Also tell them, \"Obey Allah and His Rasool.\" Inspite of this, if\n\t\t\tthey turn back then warn them, that Allah does not love the\n\t\t\tdisobedient."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "33",
        "Recitation":  "Alafasy_128kbps/003033",
        "Body":  "Indeed Allah exalted Adam, Nuh (Noah), the family of Ibrahim\n\t\t\t(Abraham) and the family of Imran above all the worlds."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "34",
        "Recitation":  "Alafasy_128kbps/003034",
        "Body":  "They were the offsprings of one another. Allah hears all and\n\t\t\tknows all."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "35",
        "Recitation":  "Alafasy_128kbps/003035",
        "Body":  "Allah heard when the wife of Imran said, \"O my Rabb! I dedicate\n\t\t\tto Your service what is in my womb. Please accept it from me. You\n\t\t\talone hear all and know all.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "36",
        "Recitation":  "Alafasy_128kbps/003036",
        "Body":  "When she gave birth to a girl instead of a boy, she said: \"My\n\t\t\tRabb! I have given birth to a girl,\" - Allah knew very well what\n\t\t\tshe had delivered - \"and that the male is not like the female, I\n\t\t\thave named her Maryem (Mary) and I seek Your protection for her\n\t\t\tand her children from the mischief of Shaitan, the accursed.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "37",
        "Recitation":  "Alafasy_128kbps/003037",
        "Body":  "Her Rabb graciously accepted that girl. He made her grow up as a\n\t\t\tgood girl and entrusted her to the care of Zakariya. Whenever\n\t\t\tZakariya entered the sanctuary to see her, he found with her\n\t\t\tfood. He asked, \"O Maryem! From where did you get it?\" She\n\t\t\treplied, \"It came from Allah. In fact, Allah gives to whom He\n\t\t\twants without measure.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "38",
        "Recitation":  "Alafasy_128kbps/003038",
        "Body":  "Thereupon Zakariya prayed to his Rabb saying: \"O my Rabb! Grant\n\t\t\tme a righteous child as Your special favor; surely You hear all\n\t\t\tprayers.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "39",
        "Recitation":  "Alafasy_128kbps/003039",
        "Body":  "As he stood praying in the Mahrab (a prayer place in the\n\t\t\tsanctuary) the angels called out to him saying: \"Allah gives you\n\t\t\tgood news of a son to be named Yahya (John), he will confirm the\n\t\t\tword of Allah, he will be a great leader and chaste, a Prophet\n\t\t\tand a righteous man.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "4",
        "Recitation":  "Alafasy_128kbps/003004",
        "Body":  "before this, as a guidance for mankind and also revealed this\n\t\t\tAl-Furqan (criterion for judgment between right and wrong).\n\t\t\tSurely those who reject Allah\u0027s revelations will be sternly\n\t\t\tpunished; Allah is Mighty, capable of retribution."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "40",
        "Recitation":  "Alafasy_128kbps/003040",
        "Body":  "He said: \"O my Rabb! How can I have a son now that I have reached\n\t\t\tan old age and my wife is barren?\" \"Such is the will of Allah\" he\n\t\t\treplied, \" Allah does what He wants.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "41",
        "Recitation":  "Alafasy_128kbps/003041",
        "Body":  "Zakariya said: \"My Rabb! Grant me a sign.\" It was said: \"Your\n\t\t\tsign is that you will not be able to speak to people for three\n\t\t\tdays except through gestures. During this time you should\n\t\t\tremember your Rabb very much and glorify Him in the evening and\n\t\t\tin the morning.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "42",
        "Recitation":  "Alafasy_128kbps/003042",
        "Body":  "There came the time when angels said: \"O Maryem! Surely Allah has\n\t\t\texalted you, purified you, and preferred you for His service over\n\t\t\tall the women of the worlds."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "43",
        "Recitation":  "Alafasy_128kbps/003043",
        "Body":  "O Maryem! Be obedient to your Rabb, prostrate and bow down in\n\t\t\tworship with other worshippers.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "44",
        "Recitation":  "Alafasy_128kbps/003044",
        "Body":  "O Muhammad, these are the news from the unseen which We are\n\t\t\trevealing to you. You were not present with them when priests of\n\t\t\tthe temple cast their pens to decide which of them should be the\n\t\t\tguardian of Maryem; nor were you with them when they argued about\n\t\t\tit."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "45",
        "Recitation":  "Alafasy_128kbps/003045",
        "Body":  "When the angels said \"O Maryem! Allah gives you the good news\n\t\t\twith a Word from Him that you will be given a son: his name will\n\t\t\tbe Messiah, Isa (Jesus Christ) the son of Maryem. He will be\n\t\t\tnoble in this world and the Hereafter; and he will be from those\n\t\t\twho are very close to Allah."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "46",
        "Recitation":  "Alafasy_128kbps/003046",
        "Body":  "He will speak to the people in the cradle and in his old age and\n\t\t\the will be among the righteous.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "47",
        "Recitation":  "Alafasy_128kbps/003047",
        "Body":  "Hearing this, Maryem said, \"O my Rabb! How can I have a son when\n\t\t\tno man has ever touched me?\" He replied, \"Even so, Allah creates\n\t\t\thowever He wants; whenever He decides to do anything, He only\n\t\t\tsays it to \u0027Be\u0027 and it is!."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "48",
        "Recitation":  "Alafasy_128kbps/003048",
        "Body":  "Allah will teach your son the Book, the Wisdom, the Taurat\n\t\t\t(Torah), and the Injeel (Gospel)"
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "49",
        "Recitation":  "Alafasy_128kbps/003049",
        "Body":  "and send him forth as a Rasool to the Children of Israel with\n\t\t\tthis message: \u0027I have brought you signs of my appointment from\n\t\t\tyour Rabb. I will make for you the likeness of a bird from clay;\n\t\t\tI will breathe into it and, with Allah\u0027s leave, it will become a\n\t\t\tliving bird. I will heal the blind and the lepers, and raise the\n\t\t\tdead to life, by Allah\u0027s leave. Furthermore, I will tell you what\n\t\t\tyou have eaten and what you have stored in your houses. Surely\n\t\t\tthese are the signs to convince you if you are believers."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "5",
        "Recitation":  "Alafasy_128kbps/003005",
        "Body":  "For sure nothing in the Earth or in the Heavens is hidden from\n\t\t\tAllah."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "50",
        "Recitation":  "Alafasy_128kbps/003050",
        "Body":  "I am appointed to confirm that which is before me from the Taurat\n\t\t\t(Torah) and to make lawful to you some of the things forbidden to\n\t\t\tyou. Now I have brought you the signs from your Rabb, therefore\n\t\t\tfear Allah and obey me."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "51",
        "Recitation":  "Alafasy_128kbps/003051",
        "Body":  "In fact, Allah is my Rabb as well as your Rabb, therefore,\n\t\t\tworship Him; this is the Right Way.\u0027\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "52",
        "Recitation":  "Alafasy_128kbps/003052",
        "Body":  "When Isa (Jesus) found out that they (most of the children of\n\t\t\tIsrael) had no faith, he asked: \"Who will help me in the cause of\n\t\t\tAllah?\" The Disciples replied: \"We will help you in the cause of\n\t\t\tAllah. We believe in Allah. Be our witness that we are Muslims.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "53",
        "Recitation":  "Alafasy_128kbps/003053",
        "Body":  "Then they invoked Allah and said): \"Our Rabb! We believe in what\n\t\t\tyou have revealed and we follow Your Rasool. Please count us with\n\t\t\tthose who bear witness.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "54",
        "Recitation":  "Alafasy_128kbps/003054",
        "Body":  "The unbelievers among the children of Israel plotted against Isa\n\t\t\tand Allah also devised a plan to raise him up, and Allah is the\n\t\t\tbest in planning."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "55",
        "Recitation":  "Alafasy_128kbps/003055",
        "Body":  "Allah said: \"O Isa (Jesus)! I am going to recall you (from your\n\t\t\tmission) and raise you up to Myself. I will clean you of those\n\t\t\twho rejected you and exalt your followers above the unbelievers\n\t\t\ttill the Day of Resurrection; then to Me shall be your return and\n\t\t\tI shall judge those matters in which you have been disputing."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "56",
        "Recitation":  "Alafasy_128kbps/003056",
        "Body":  "Those who are unbelievers will be punished with severe punishment\n\t\t\tin this world and the Hereafter; they shall have no helpers."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "57",
        "Recitation":  "Alafasy_128kbps/003057",
        "Body":  "As for those who believe and do good deeds, Allah will pay them\n\t\t\ttheir full reward. Allah does not love the transgressors.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "58",
        "Recitation":  "Alafasy_128kbps/003058",
        "Body":  "This revelation which We recite to you is full of signs and wise\n\t\t\treminders."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "59",
        "Recitation":  "Alafasy_128kbps/003059",
        "Body":  "In fact the example of the birth of Isa ( Jesus) in the sight of\n\t\t\tAllah is like the example of Adam who had no father and mother,\n\t\t\twhom He created out of dust, then said to him: \"Be\" and he was."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "6",
        "Recitation":  "Alafasy_128kbps/003006",
        "Body":  "It is He Who shapes your bodies in the wombs of your mothers as\n\t\t\tHe pleases. There is no god but Him; the Mighty, the Wise."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "60",
        "Recitation":  "Alafasy_128kbps/003060",
        "Body":  "This is the Truth from your Rabb, therefore, do not be of those\n\t\t\twho doubt it."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "61",
        "Recitation":  "Alafasy_128kbps/003061",
        "Body":  "If anyone disputes with you concerning this matter (the birth of\n\t\t\tJesus) after full knowledge has come to you, say: \"Come! Let us\n\t\t\tgather our sons and your sons, our women and your women,\n\t\t\tourselves and yourselves: then let us earnestly pray and invoke\n\t\t\tthe curse of Allah on the liars.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "62",
        "Recitation":  "Alafasy_128kbps/003062",
        "Body":  "Verily this is the absolute true explanation. The fact of the\n\t\t\tmatter is, that there is no god but Allah; and for sure Allah is\n\t\t\tthe Mighty, the Wise."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "63",
        "Recitation":  "Alafasy_128kbps/003063",
        "Body":  "But if they turn away from accepting this challenge, it will be\n\t\t\tclear proof of their mischief and Allah has the full knowledge of\n\t\t\tmischief-makers."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "64",
        "Recitation":  "Alafasy_128kbps/003064",
        "Body":  "Say: \"O people of the Book! Let us get together on what is common\n\t\t\tbetween us and you: that we shall worship none but Allah; that we\n\t\t\tshall not associate any partners with Him; that we shall not take\n\t\t\tfrom among ourselves any lords beside Allah.\" If they reject your\n\t\t\tinvitation then tell them: \"Bear witness that we are Muslims (who\n\t\t\thave surrendered to Allah).\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "65",
        "Recitation":  "Alafasy_128kbps/003065",
        "Body":  "O people of the Book! Why do you argue with us about Ibrahim, as\n\t\t\tto whether he was a Jew or a Christian? You know, that the Taurat\n\t\t\t(Torah) and the Injeel (Gospel) were revealed long after him?\n\t\t\tHave you no sense at all?"
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "66",
        "Recitation":  "Alafasy_128kbps/003066",
        "Body":  "So far you have been arguing about things of which you had some\n\t\t\tknowledge! Must you now argue about that of which you know\n\t\t\tnothing at all? Allah knows while you do not."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "67",
        "Recitation":  "Alafasy_128kbps/003067",
        "Body":  "Ibrahim was neither a Jew nor a Christian but he was a Muslim,\n\t\t\ttrue in faith. He was not one of the mushrikin (who set up\n\t\t\tpartners with Allah)."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "68",
        "Recitation":  "Alafasy_128kbps/003068",
        "Body":  "Surely the people nearest to Ibrahim are those who follow him,\n\t\t\twhich are this Prophet (Muhammad) and those who believe with him;\n\t\t\tAllah is the Protector of only those who are the believers."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "69",
        "Recitation":  "Alafasy_128kbps/003069",
        "Body":  "Some of the People of the Book want to mislead you; but they\n\t\t\tmislead none except themselves, though they do not realize it."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "7",
        "Recitation":  "Alafasy_128kbps/003007",
        "Body":  "He is the One Who has revealed to you the Book. Some of its\n\t\t\tverses are decisive - they are the foundation of the Book - while\n\t\t\tothers are allegorical. Those whose hearts are infected with\n\t\t\tdisbelief follow the allegorical part to mislead others and to\n\t\t\tgive it their own interpretation, seeking for its hidden\n\t\t\tmeanings, but no one knows its hidden meanings except Allah.\n\t\t\tThose who are well grounded in knowledge say: \"We believe in it;\n\t\t\tit is all from our Rabb.\" None will take heed except the people\n\t\t\tof understanding."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "70",
        "Recitation":  "Alafasy_128kbps/003070",
        "Body":  "O People of the Book! Why you deny the revelations of Allah while\n\t\t\tyou know that they are true?"
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "71",
        "Recitation":  "Alafasy_128kbps/003071",
        "Body":  "O People of the Book! Why do you confound the truth with\n\t\t\tfalsehood and knowingly conceal the truth?"
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "72",
        "Recitation":  "Alafasy_128kbps/003072",
        "Body":  "Some of the People of the Book say to one another: \"Believe in\n\t\t\twhat is revealed to the believers (Muslims) in the morning and\n\t\t\tdeny it in the evening; so that they (the Muslims) may follow\n\t\t\tsuit and abandon their faith."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "73",
        "Recitation":  "Alafasy_128kbps/003073",
        "Body":  "Do not follow anyone except the one who follows your own\n\t\t\treligion.\" O Muhammad, tell them: \"The only true guidance is the\n\t\t\tguidance of Allah.\" These people of the Book do not believe that\n\t\t\trevelation could be sent to anyone besides themselves, like that\n\t\t\twhich has been sent to you; or that they will ever argue with you\n\t\t\tin the presence of your Rabb. Tell them: \"For sure, grace is in\n\t\t\tthe hands of Allah: He bestows it on whom He pleases; Allah has\n\t\t\tboundless knowledge.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "74",
        "Recitation":  "Alafasy_128kbps/003074",
        "Body":  "He chooses for His mercy whom He pleases, Allah is the Owner of\n\t\t\tmighty grace."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "75",
        "Recitation":  "Alafasy_128kbps/003075",
        "Body":  "Among the People of the Book there are some who, if you trust\n\t\t\tthem with a heap of gold, will readily return it back; and there\n\t\t\tare others who, if you trust them with a single dinar (silver\n\t\t\tcoin) will not return it back unless you constantly keep on\n\t\t\tdemanding; because they say, \"We are not going to be called to\n\t\t\taccount for our behavior with the illiterates (non Jews or\n\t\t\tChristians).\" Thus they deliberately ascribe a lie to Allah -\n\t\t\tknowing well that He never permitted such wrongdoing."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "76",
        "Recitation":  "Alafasy_128kbps/003076",
        "Body":  "In fact, those who keep their promise and guard themselves\n\t\t\tagainst evil are His beloved, for Allah loves only those who\n\t\t\tguard themselves against such evils."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "77",
        "Recitation":  "Alafasy_128kbps/003077",
        "Body":  "In fact those who sell the covenants of Allah and their own oaths\n\t\t\tfor a petty price, shall have no portion in the hereafter. Allah\n\t\t\twill neither speak to them nor even look at them nor cleanse them\n\t\t\tfrom their sins on the Day of Judgment. They shall have painful\n\t\t\tpunishment."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "78",
        "Recitation":  "Alafasy_128kbps/003078",
        "Body":  "There are some among them who twist their tongues pretending a\n\t\t\tquote from their Holy Book; so that you may think that what they\n\t\t\tread is a part of the Book, whereas, in fact it is not a part of\n\t\t\tthe Book. They also assert, \"It is from Allah\" whereas, in fact\n\t\t\tit is not from Allah. Thus they deliberately ascribe a lie to\n\t\t\tAllah."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "79",
        "Recitation":  "Alafasy_128kbps/003079",
        "Body":  "It is not possible for a man whom Allah has given the Book, the\n\t\t\tWisdom and the Prophethood, that he would say to the people:\n\t\t\t\"Worship me instead of Allah.\" On the contrary he would say: \"Be\n\t\t\tdevoted worshippers of your Rabb in accordance with the Holy Book\n\t\t\tyou have been teaching and reading.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "8",
        "Recitation":  "Alafasy_128kbps/003008",
        "Body":  "They say: \"Our Rabb, Do not cause our hearts to deviate now after\n\t\t\tyou have guided us. Grant us Your own mercy; You are the Grantor\n\t\t\tof bounties without measure."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "80",
        "Recitation":  "Alafasy_128kbps/003080",
        "Body":  "He would never ask you to take angels and prophets as your lords.\n\t\t\tWould he ask you to become kafir (unbelievers) after you have\n\t\t\tbecome Muslims (believers)?"
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "81",
        "Recitation":  "Alafasy_128kbps/003081",
        "Body":  "Allah took the covenant with the Prophets, saying: \"Now that you\n\t\t\thave been given the Book and Wisdom; there will come to you a\n\t\t\tRasool who will confirm that which is with you; you will have to\n\t\t\tbelieve in him and help him in his mission.\" Then He said \"Do you\n\t\t\taffirm this covenant and agree to take this heavy\n\t\t\tresponsibility?\" The Prophets replied, \"Yes, we do affirm.\" Allah\n\t\t\tsaid, \"Very well, bear witness to this and I too bear witness\n\t\t\twith you.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "82",
        "Recitation":  "Alafasy_128kbps/003082",
        "Body":  "Now if anyone turns back after this, he will become the\n\t\t\ttransgressor."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "83",
        "Recitation":  "Alafasy_128kbps/003083",
        "Body":  "Are they looking for a religion other than the Deen (religion and\n\t\t\tWay of Life) of Allah knowing well that everything in the heavens\n\t\t\tand in the earth, willingly or unwillingly, has submitted to Him?\n\t\t\tAnd to Him they shall all return."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "84",
        "Recitation":  "Alafasy_128kbps/003084",
        "Body":  "O Prophet, say: \"We believe in Allah and what is revealed to us\n\t\t\tand what was revealed to Ibrahim (Abraham), Isma`il (Ishmael),\n\t\t\tIshaq (Isaac), Ya\u0027qoob (Jacob) and their descendants; and in that\n\t\t\twhich was given to Musa (Moses), Isa (Jesus) and other Prophets\n\t\t\tfrom their Rabb; we do not discriminate any one of them, and to\n\t\t\tAllah do we submit in Islam.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "85",
        "Recitation":  "Alafasy_128kbps/003085",
        "Body":  "If anyone is looking for a religion other than Islam, then let it\n\t\t\tbe known that it will not be accepted from him; and in the\n\t\t\tHereafter he will be among the losers."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "86",
        "Recitation":  "Alafasy_128kbps/003086",
        "Body":  "How it can be that Allah would guide those people who commit Kufr\n\t\t\t(reject faith) after their Iman (acceptance of faith),\n\t\t\tacknowledge that the Rasool is true, and clear proofs have come\n\t\t\tto them? Allah does not guide such wrongdoers."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "87",
        "Recitation":  "Alafasy_128kbps/003087",
        "Body":  "The reward of such people is that upon them is the curse of\n\t\t\tAllah, the angels and all mankind."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "88",
        "Recitation":  "Alafasy_128kbps/003088",
        "Body":  "They shall remain under it for ever; neither will their\n\t\t\tpunishment be lightened nor will they be given respite."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "89",
        "Recitation":  "Alafasy_128kbps/003089",
        "Body":  "However, those who repent after this and mend their ways, then\n\t\t\tverily Allah is Forgiving, Merciful."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "9",
        "Recitation":  "Alafasy_128kbps/003009",
        "Body":  "Our Rabb, You will surely gather all mankind before You on the\n\t\t\tDay about which there is no doubt; surly Allah does not break His\n\t\t\tpromise.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "90",
        "Recitation":  "Alafasy_128kbps/003090",
        "Body":  "However, those who disbelieve after their belief (acceptance of\n\t\t\tIslam) then go on adding to their disbelief, their repentance\n\t\t\twill never be accepted; because they intentionally chose to go\n\t\t\tastray."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "91",
        "Recitation":  "Alafasy_128kbps/003091",
        "Body":  "As to those who are unbelievers and die while they were\n\t\t\tunbelievers, if they were to fill the whole earth with gold and\n\t\t\toffer as a ransom for each one of them, that will not be\n\t\t\taccepted. These are the ones who shall have the painful\n\t\t\tpunishment, and shall have no helpers."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "92",
        "Recitation":  "Alafasy_128kbps/003092",
        "Body":  "You can never attain righteousness unless you spend in the cause\n\t\t\tof Allah that which you dearly cherish; and whatever you spend,\n\t\t\tsurely it is known to Allah."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "93",
        "Recitation":  "Alafasy_128kbps/003093",
        "Body":  "All food, that is lawful in Islamic Law, was also Halal (lawful)\n\t\t\tfor the children of Israel except what Israel (Ya\u0027qoob) made\n\t\t\tHaram (unlawful) for himself before the Taurat (Torah) was\n\t\t\trevealed to Musa. Ask them: \"Bring the Taurat (Torah) and read a\n\t\t\tpassage from it in support of your objection, if what you say is\n\t\t\ttrue.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "94",
        "Recitation":  "Alafasy_128kbps/003094",
        "Body":  "Then whoever fabricates a lie against Allah after this, will\n\t\t\tindeed be unjust."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "95",
        "Recitation":  "Alafasy_128kbps/003095",
        "Body":  "Say: \"Allah has declared the truth. If you are sincere then\n\t\t\tfollow the faith of Ibrahim (Abraham); he was upright and not a\n\t\t\tmushrik.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "96",
        "Recitation":  "Alafasy_128kbps/003096",
        "Body":  "Undoubtedly the first House for the worship of Allah ever built\n\t\t\tfor mankind is the one at Bakka (Makkah), a blessed site and a\n\t\t\tguidance for all the worlds."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "97",
        "Recitation":  "Alafasy_128kbps/003097",
        "Body":  "In it are clear signs and the Station of Ibrahim (Abraham) where\n\t\t\the used to worship. Whoever enters it is safe. Performance of\n\t\t\tHajj (pilgrimage) to this House is a duty to Allah for all who\n\t\t\tcan afford the journey to it; and the one who disobeys this\n\t\t\tcommandment should know that Allah is Self-sufficient, beyond the\n\t\t\tneed of anyone from the worlds."
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "98",
        "Recitation":  "Alafasy_128kbps/003098",
        "Body":  "Say: \"O people of the Book! Why do you deny the revelations of\n\t\t\tAllah? Allah Himself is a witness to your actions.\""
    },
    {
        "BookCode":  "MAL",
        "SurahNumber":  "3",
        "AyahNumber":  "99",
        "Recitation":  "Alafasy_128kbps/003099",
        "Body":  "Say: \"O people of the Book! Why do you obstruct the believers\n\t\t\tfrom the path of Allah and desire that they follow the crooked\n\t\t\tway while you yourselves are witnesses to Allah\u0027s Covenant? Allah\n\t\t\tis not unmindful of what you do.\""
    }
]
