[
    {
        "BookCode":  "HDQ",
        "HadithNumber":  "1",
        "Body":  "\u003cp\u003e\n\t\t\tWhen Allah decreed the Creation He pledged Himself by writing in\n\t\t\tHis book which is laid down with Him: My mercy prevails over my\n\t\t\twrath.\n\t\t\u003c/p\u003e"
    },
    {
        "BookCode":  "HDQ",
        "HadithNumber":  "2",
        "Body":  "\u003cp\u003e\r\n\t\t\tThe son of Adam denied Me and he had no right to do so. And he\r\n\t\t\treviled Me and he had no right to do so. As for his denying Me,\r\n\t\t\tit is his saying: He will not remake me as He made me at first -\r\n\t\t\tand the initial creation [of him] is no easier for Me than\r\n\t\t\tremaking him. As for his reviling Me, it is his saying: Allah has\r\n\t\t\ttaken to Himself a son, while I am the One, the Everlasting\r\n\t\t\tRefuge. I begot not nor was I begotten, and there is none\r\n\t\t\tcomparable to Me.\r\n\t\t\u003c/p\u003e"
    },
    {
        "BookCode":  "HDQ",
        "HadithNumber":  "3",
        "Body":  "\u003cp\u003e\n\t\t\tThe Messenger of Allah (may the blessings and peace of Allah be\n\t\t\tupon him) led the morning prayer for us at al-Hudaybiyah\n\t\t\tfollowing rainfall during the night. When the Prophet (may the\n\t\t\tblessings and peace of Allah be upon him) finished, he faced the\n\t\t\tpeople and said to them: Do you know what your Lord has said?\n\t\t\tThey said: Allah and his Messenger know best. He said: This\n\t\t\tmorning one of my servants became a believer in Me and one a\n\t\t\tdisbeliever. As for him who said: We have been given rain by\n\t\t\tvirtue of Allah and His mercy, that one is a believer in Me, a\n\t\t\tdisbeliever in the stars; and as for him who said: We have been\n\t\t\tgiven rain by such-and-such a star, that one is a disbeliever in\n\t\t\tMe, a believer in the stars.\n\t\t\u003c/p\u003e"
    },
    {
        "BookCode":  "HDQ",
        "HadithNumber":  "4",
        "Body":  "\u003cp\u003e\n\t\t\tSons of Adam inveigh against [the vicissitudes of] Time, and I am\n\t\t\tTime, in My hand is the night and the day.\n\t\t\u003c/p\u003e"
    },
    {
        "BookCode":  "HDQ",
        "HadithNumber":  "5",
        "Body":  "\u003cp\u003e\n\t\t\tI am so self-sufficient that I am in no need of having an\n\t\t\tassociate.  Thus he who does an action for someone else\u0027s sake as\n\t\t\twell as Mine will have that action renounced by Me to him whom he\n\t\t\tassociated with Me.\n\t\t\u003c/p\u003e"
    },
    {
        "BookCode":  "HDQ",
        "HadithNumber":  "6",
        "Body":  "\u003cp\u003e\n\t\t\tThe first of people against whom judgment will be pronounced on\n\t\t\tthe Day of Resurrection will be a man who died a martyr.  He will\n\t\t\tbe brought and Allah will make known to him His favours and he\n\t\t\twill recognize them.  [ The Almighty] will say: And what did you\n\t\t\tdo about them? He will say: I fought for you until I died a\n\t\t\tmartyr.  He will say: You have lied - you did but fight that it\n\t\t\tmight be said [of you]: He is courageous.  And so it was said. \n\t\t\tThen he will be ordered to be dragged along on his face until he\n\t\t\tis cast into Hell-fire.  [Another] will be a man who has studied\n\t\t\t[religious] knowledge and has taught it and who used to recite\n\t\t\tthe Quran.  He will be brought and Allah will make known to his\n\t\t\tHis favours and he will recognize them.  [The Almighty] will say:\n\t\t\tAnd what did you do about them?  He will say: I studied\n\t\t\t[religious] knowledge and I taught it and I recited the Quran for\n\t\t\tYour sake.  He will say: You have lied - you did but study\n\t\t\t[religious] knowledge that it might be said [of you]: He is\n\t\t\tlearned.  And you recited the Quran that it might be said [of\n\t\t\tyou]: He is a reciter.\tAnd so it was said.  Then he will be\n\t\t\tordered to be dragged along on his face until he is cast into\n\t\t\tHell-fire.  [Another] will be a man whom Allah had made rich and\n\t\t\tto whom He had given all kinds of wealth.  He will be brought and\n\t\t\tAllah will make known to his His favours and he will recognize\n\t\t\tthem.  [The Almighty] will say: And what did you do about them? \n\t\t\tHe will say: I left no path [untrodden] in which You like money\n\t\t\tto be spent without spending in it for Your sake.  He will say:\n\t\t\tYou have lied - you did but do so that it might be said [of you]:\n\t\t\tHe is open-handed.  And so it was said.  Then he will be ordered\n\t\t\tto be dragged along on his face until he is cast into Hell-fire.\n\t\t\u003c/p\u003e"
    },
    {
        "BookCode":  "HDQ",
        "HadithNumber":  "7",
        "Body":  "\u003cp\u003e\n\t\t\tYour Lord delights at a shepherd who, on the peak of a mountain\n\t\t\tcrag, gives the call to prayer and prays.  Then Allah (glorified\n\t\t\tand exalted be He) say: Look at this servant of Mine, he gives\n\t\t\tthe call to prayer and performs the prayers;  he is in awe of Me.\n\t\t\t I have forgiven My servant [his sins] and have admitted him to\n\t\t\tParadise.\n\t\t\u003c/p\u003e"
    },
    {
        "BookCode":  "HDQ",
        "HadithNumber":  "8",
        "Body":  "\u003cp\u003e\n\t\t\tA prayer performed by someone who has not recited the Essence of\n\t\t\tthe Quran during it is deficient (and he repeated the word three\n\t\t\ttimes), incomplete.  Someone said to Abu Hurayrah: [Even though]\n\t\t\twe are behind the imam?  He said: Recite it to yourself, for I\n\t\t\thave heard the Prophet (may the blessings and peace of Allah be\n\t\t\tup on him) say: Allah (mighty and sublime be He), had said: I\n\t\t\thave divided prayer between Myself and My servant into two\n\t\t\thalves, and My servant shall have what he has asked for.  When\n\t\t\tthe servant says: Al-hamdu lillahi rabbi l-alamin, Allah (mighty\n\t\t\tand sublime be He) says: My servant has praised Me.  And when he\n\t\t\tsays: Ar-rahmani r-rahim, Allah (mighty and sublime be He) says:\n\t\t\tMy servant has extolled Me, and when he says: Maliki yawmi d-din,\n\t\t\tAllah says: My servant has glorified Me - and on one occasion He\n\t\t\tsaid: My servant has submitted to My power.  And when he says:\n\t\t\tIyyaka na budu wa iyyaka nasta in, He says: This is between Me\n\t\t\tand My servant, and My servant shall have what he has asked for. \n\t\t\tAnd when he says: Ihdina s-sirata l- mustaqim, siratal ladhina an\n\t\t\tamta alayhim ghayril-maghdubi alayhim wa la d-dallin, He says:\n\t\t\tThis is for My servant, and My servant shall have what he has\n\t\t\tasked for.\n\t\t\u003c/p\u003e"
    },
    {
        "BookCode":  "HDQ",
        "HadithNumber":  "9",
        "Body":  "\u003cp\u003e\n\t\t\tThe fist of his actions for which a servant of Allah will be held\n\t\t\taccountable on the Day of Resurrection will be his prayers.  If\n\t\t\tthey are in order, then he will have prospered and succeeded: and\n\t\t\tif they are wanting, then he will have failed and lost.  If there\n\t\t\tis something defective in his obligatory prayers, the Lord\n\t\t\t(glorified and exalted be He) will say: See if My servant has any\n\t\t\tsupererogatory prayers with which may be completed that which was\n\t\t\tdefective in his obligatory prayers.  Then the rest of his\n\t\t\tactions will be judged in like fashion.\n\t\t\u003c/p\u003e"
    },
    {
        "BookCode":  "HDQ",
        "HadithNumber":  "10",
        "Body":  "\u003cp\u003e\n\t\t\tFasting is Mine and it I who give reward for it.  [A man] gives\n\t\t\tup his sexual passion, his food and his drink for my sake. \n\t\t\tFasting is like a shield, and he who fasts has two joys: a joy\n\t\t\twhin he breaks his fast and a joy when he meets his Lord.  The\n\t\t\tchange in the breath of the mouth of him who fasts is better in\n\t\t\tAllah\u0027s estimation than the smell of musk.\n\t\t\u003c/p\u003e"
    },
    {
        "BookCode":  "HDQ",
        "HadithNumber":  "11",
        "Body":  "\u003cp\u003e\n\t\t\tSpend (on charity), O son of Adam, and I shall spend on you.\n\t\t\u003c/p\u003e"
    },
    {
        "BookCode":  "HDQ",
        "HadithNumber":  "12",
        "Body":  "\u003cp\u003e\n\t\t\tA man from among those who were before you was called to account.\n\t\t\t Nothing in the way of good was found for him except that he used\n\t\t\tto have dealings with people and, being well-to-do, he would\n\t\t\torder his servants to let off the man in straitened circumstances\n\t\t\t[from repaying his debt].  He (the Prophet p.b.u.h) said that\n\t\t\tAllah said: We are worthier than you of that (of being so\n\t\t\tgenerous).  Let him off.\n\t\t\u003c/p\u003e"
    },
    {
        "BookCode":  "HDQ",
        "HadithNumber":  "13",
        "Body":  "\u003cp\u003e\n\t\t\tI was with the Messenger of Allah (may the blessings and peace of\n\t\t\tAllah be upon him) and there came to him two men: one of them was\n\t\t\tcomplaining of penury (being very poor), while the other was\n\t\t\tcomplaining of brigandry (robbery).  The Messenger of Allah (may\n\t\t\tthe blessings and peace of Allah be upon him) said: As for\n\t\t\tbrigandry, it will be but a short time before a caravan will [be\n\t\t\table to] go out of Mecca without a guard.  As for penury, the\n\t\t\tHour (Day of Judgement) will not arrive before one of you takes\n\t\t\this charity around without finding anyone to accept it from him. \n\t\t\tThen one of you will surely stand before Allah, there being no\n\t\t\tscreed between Him and him, nor an interpreter to translate for\n\t\t\thim.  Then He will say to him: Did I not bring you wealth? And he\n\t\t\twill say: Yes.\tThen He will say: Did I not send to you a\n\t\t\tmessenger?  And he will say: Yes.  And he will look to his right\n\t\t\tand will see nothing but Hell-fire, then he will look to his left\n\t\t\tand will see nothing but Hell-fire, so let each of you protect\n\t\t\thimself against Hell-fire, be it with even half a date - and if\n\t\t\the finds it not, then with a kind word.\n\t\t\u003c/p\u003e"
    },
    {
        "BookCode":  "HDQ",
        "HadithNumber":  "14",
        "Body":  "\u003cp\u003e\n\t\t\tAllah (glorified and exalted be He) has supernumerary angels who\n\t\t\trove about seeking out gatherings in which Allah\u0027s name is being\n\t\t\tinvoked: they sit with them and fold their wings round each\n\t\t\tother, fillin that which is between them and between the lowest\n\t\t\theaven.  When [the people in the gathering] depart, [the angels]\n\t\t\tascend and rise up to heaven.  He (the Prophet p.b.u.h.) said:\n\t\t\tThen Allah (mighty and sublime be He) asks them - [though] He is\n\t\t\tmost knowing about them: From where have you come? And they say:\n\t\t\tWe have come from some servants of Yours on Earth: they were\n\t\t\tglorifying You (Subhana llah), exalting you (Allahu akbar),\n\t\t\twitnessing that there is no god but You (La ilaha illa llah),\n\t\t\tpraising You (Al-Hamdu lillah), and asking [favours] of You.  He\n\t\t\tsays: And what do they ask of Me?  They say: They ask of You Your\n\t\t\tParadise.  He says: And have they seen My Paradise?  They say:\n\t\t\tNo, O Lord.  He says: And how would it be were they to have seen\n\t\t\tMy Paradise!  They say: And they ask protection of You.  He says:\n\t\t\tFrom what do they ask protection of Me?  They say: From Your\n\t\t\tHell-fire, O Lord.  He says: And have they seen My Hell-fire? \n\t\t\tThey say: NO.  He says: And how would it be were they to have\n\t\t\tseen My Hell-fire:  They say: And they ask for Your forgiveness. \n\t\t\tHe (the Prophet p.b.u.h) said: Then He says: I have forgiven them\n\t\t\tand I have bestowed upon them what they have asked for,and I have\n\t\t\tgranted them sanctuary from that from which they asked\n\t\t\tprotection.  He (the Prophet p.b.u.h) said: They say: O Lord,\n\t\t\tamong then is So-and-so, a much sinning servant, who was merely\n\t\t\tpassing by and sat down with them.  He (the Prophet p.b.u.h)\n\t\t\tsaid: And He says: And to him [too] I have given forgiveness: he\n\t\t\twho sits with such people shall not suffer.\n\t\t\u003c/p\u003e"
    },
    {
        "BookCode":  "HDQ",
        "HadithNumber":  "15",
        "Body":  "\u003cp\u003e\n\t\t\tI am as My servant thinks I am.  I am with him when he makes\n\t\t\tmention of Me.\tIf he makes mention of Me to himself, I make\n\t\t\tmention of him to Myself; and if he makes mention of Me in an\n\t\t\tassembly, I make mention of him in an assemble better than it. \n\t\t\tAnd if he draws near to Me an arm\u0027s length, I draw near to him a\n\t\t\tfathom\u0027s length.  And if he comes to Me walking, I go to him at\n\t\t\tspeed.\n\t\t\u003c/p\u003e"
    },
    {
        "BookCode":  "HDQ",
        "HadithNumber":  "16",
        "Body":  "\u003cp\u003e\n\t\t\tAllah has written down the good deeds and the bad ones.  Then He\n\t\t\texplained it [by saying that] he who has intended a good deed and\n\t\t\thas not done it, Allah writes it down with Himself as a full good\n\t\t\tdeed, but if he has intended it and has done it, Allah writes it\n\t\t\tdown with Himself as from ten good deeds to seven hundred times,\n\t\t\tor many times over.  But if he has intended a bad deed and has\n\t\t\tnot done it, Allah writes it down with Himself as a full good\n\t\t\tdeed, but if he has intended it and has done it, Allah writes it\n\t\t\tdown as one bad deed.\n\t\t\u003c/p\u003e"
    },
    {
        "BookCode":  "HDQ",
        "HadithNumber":  "17",
        "Body":  "\u003cp\u003e\n\t\t\tO My servants, I have forbidden oppression for Myself and have\n\t\t\tmade it forbidden amongst you, so do not oppress one another.  O\n\t\t\tMy servants, all of you are astray except for those I have\n\t\t\tguided, so seek guidance of Me and I shall guide you, O My\n\t\t\tservants, all of you are hungry except for those I have fed, so\n\t\t\tseek food of Me and I shall feed you.  O My servants, all of you\n\t\t\tare naked except for those I have clothed, so seek clothing of Me\n\t\t\tand I shall clothe you.  O My servants, you sin by night and by\n\t\t\tday, and I forgive all sins, so seek forgiveness of Me and I\n\t\t\tshall forgive you.  O My servants, you will not attain harming Me\n\t\t\tso as to harm Me, and will not attain benefitting Me so as to\n\t\t\tbenefit Me.  O My servants, were the first of you and the last of\n\t\t\tyou, the human of you and the jinn of you to be as pious as the\n\t\t\tmost pious heart of any one man of you, that would not increase\n\t\t\tMy kingdom in anything.  O My servants, were the first of you and\n\t\t\tthe last of you, the human of you and the jinn of you to be as\n\t\t\twicked as the most wicked heart of any one man of you, that would\n\t\t\tnot decrease My kingdom in anything.  O My servants, were the\n\t\t\tfirst of you and the last of you, the human of you and the jinn\n\t\t\tof you to rise up in one place and make a request of Me, and were\n\t\t\tI to give everyone what he requested, that would not decrease\n\t\t\twhat I have, any more that a needle decreases the sea if put into\n\t\t\tit.  O My servants, it is but your deeds that I reckon up for you\n\t\t\tand then recompense you for, so let him finds good praise Allah\n\t\t\tand let him who finds other that blame no one but himself.\n\t\t\u003c/p\u003e"
    },
    {
        "BookCode":  "HDQ",
        "HadithNumber":  "18",
        "Body":  "\u003cp\u003e\n\t\t\tO son of Adam, I fell ill and you visited Me not.  He will say: O\n\t\t\tLord, and how should I visit You when You are the Lord of the\n\t\t\tworlds?  He will say: Did you not know that My servant So-and-so\n\t\t\thad fallen ill and you visited him not?  Did you not know that\n\t\t\thad you visited him you would have found Me with him?  O son of\n\t\t\tAdam, I asked you for food and you fed Me not.\tHe will say: O\n\t\t\tLord, and how should I feed You when You are the Lord of the\n\t\t\tworlds?  He will say: Did you not know that My servant So-and-so\n\t\t\tasked you for food and you fed him not?  Did you not know that\n\t\t\thad you fed him you would surely have found that (the reward for\n\t\t\tdoing so) with Me?  O son of Adam, I asked you to give Me to\n\t\t\tdrink and you gave Me not to drink.  He will say: O Lord, how\n\t\t\tshould I give You to drink whin You are the Lord of the worlds? \n\t\t\tHe will say: My servant So-and-so asked you to give him to drink\n\t\t\tand you gave him not to drink.\tHad you given him to drink you\n\t\t\twould have surely found that with Me.\n\t\t\u003c/p\u003e"
    },
    {
        "BookCode":  "HDQ",
        "HadithNumber":  "19",
        "Body":  "\u003cp\u003e\n\t\t\tPride is my cloak and greatness My robe, and he who competes with\n\t\t\tMe in respect of either of them I shall cast into Hell-fire.\n\t\t\u003c/p\u003e"
    },
    {
        "BookCode":  "HDQ",
        "HadithNumber":  "20",
        "Body":  "\u003cp\u003e\n\t\t\tThe gates of Paradise will be opened on Mondays and on Thursdays,\n\t\t\tand every servant [of Allah] who associates nothing with Allah\n\t\t\twill be forgiven, except for the man who has a grudge against his\n\t\t\tbrother.  [About them] it will be said: Delay these two until\n\t\t\tthey are reconciled; delay these two until they are reconciled.\n\t\t\u003c/p\u003e"
    },
    {
        "BookCode":  "HDQ",
        "HadithNumber":  "21",
        "Body":  "\u003cp\u003e\n\t\t\tThere are three whose adversary I shall be on the Day of\n\t\t\tResurrection: a man who has given his word by Me and has broken\n\t\t\tit; a man who has sold a free man and has consumed the price; and\n\t\t\ta man who has hired a workman, has exacted his due in full from\n\t\t\thim and has not given him his wage.\n\t\t\u003c/p\u003e"
    },
    {
        "BookCode":  "HDQ",
        "HadithNumber":  "22",
        "Body":  "\u003cp\u003e\n\t\t\tLet not any one of you belittle himself.  They said: O Messenger\n\t\t\tof Allah, how can any one of us belittle himself?  He said: He\n\t\t\tfinds a matter concerning Allah about which he should say\n\t\t\tsomething, and he does not say [it], so Allah (mighty and sublime\n\t\t\tbe He) says to him on the Day of Resurrection: What prevented you\n\t\t\tfrom saying something about such-and-such and such-and-such?  He\n\t\t\tsay: [It was] out of fear of people.  Then He says: Rather it is\n\t\t\tI whom you should more properly fear.\n\t\t\u003c/p\u003e"
    },
    {
        "BookCode":  "HDQ",
        "HadithNumber":  "23",
        "Body":  "\u003cp\u003e\n\t\t\tWhere are those who love one another through My glory?\tToday I\n\t\t\tshall give them shade in My shade, it being a day when there is\n\t\t\tno shade but My shade.\n\t\t\u003c/p\u003e"
    },
    {
        "BookCode":  "HDQ",
        "HadithNumber":  "24",
        "Body":  "\u003cp\u003e\n\t\t\tIf Allah has loved a servant [of His] He calls Gabriel (on whom\n\t\t\tbe peace) and says: I love So-and-so, therefore love him.  He\n\t\t\t(the Prophet pbuh) said: So Gabriel loves him.\tThen he (Gabriel)\n\t\t\tcalls out in heaven, saying:  Allah loves So-and-so, therefore\n\t\t\tlove him.  And the inhabitants of heaven love him.  He (the\n\t\t\tProphet pbuh) said: Then acceptance is established for him on\n\t\t\tearth.\tAnd if Allah has abhorred a servant [of His], He calls\n\t\t\tGabriel and says: I abhor So-and-so, therefore abhor him.  So\n\t\t\tGabriel abhors him.  Then Gabriel calls out to the inhabitants of\n\t\t\theaven: Allah abhors So-and-so, therefore abhor him.  He (the\n\t\t\tProphet pbuh) said: So they abhor him, and abhorrence is\n\t\t\testablished for him on earth.\n\t\t\u003c/p\u003e"
    },
    {
        "BookCode":  "HDQ",
        "HadithNumber":  "25",
        "Body":  "\u003cp\u003e\n\t\t\tWhosoever shows enmity to someone devoted to Me, I shall be at\n\t\t\twar with him.  My servant draws not near to Me with anything more\n\t\t\tloved by Me than the religious duties I have enjoined upon him,\n\t\t\tand My servant continues to draw near to Me with supererogatory\n\t\t\tworks so that I shall love him.  When I love him I am his hearing\n\t\t\twith which he hears, his seeing with which he sees, his hand with\n\t\t\twhich he strikes and his foot with which he walks.  Were he to\n\t\t\task [something] of Me, I would surely give it to him, and were he\n\t\t\tto ask Me for refuge, I would surely grant him it.  I do not\n\t\t\thesitate about anything as much as I hesitate about [seizing] the\n\t\t\tsoul of My faithful servant: he hates death and I hate hurting\n\t\t\thim.\n\t\t\u003c/p\u003e"
    },
    {
        "BookCode":  "HDQ",
        "HadithNumber":  "26",
        "Body":  "\u003cp\u003e\n\t\t\tTruly of those devoted to Me the one I most favour is a believer\n\t\t\twho is of meagre means and much given to prayer, who has been\n\t\t\tparticular in the worship of his Lord and has obeyed Him\n\t\t\tinwardly, who was obscure among people and not pointed our, and\n\t\t\twhose sustenance was just sufficient to provide for him yet he\n\t\t\tbore this patiently.  Then the Prophet (pbuh) rapped his hand and\n\t\t\tsaid: Death will have come early to him, his mourners will have\n\t\t\tbeen few,  his estate scant.\n\t\t\u003c/p\u003e"
    },
    {
        "BookCode":  "HDQ",
        "HadithNumber":  "27",
        "Body":  "\u003cp\u003e\n\t\t\tWe asked Abdullah (i.e. Ibn Masud) about this verse: And do not\n\t\t\tregard those who have been killed in the cause of Allah as dead,\n\t\t\trather are they alive with their Lord, being provided for (Quran\n\t\t\tChapter 3 Verse 169).  He said: We asked about that and the\n\t\t\tProphet (pbuh) said: Their souls are in the insides of green\n\t\t\tbirds having lanterns suspended from the Throne, roaming freely\n\t\t\tin Paradise where they please, then taking shelter in those\n\t\t\tlanterns.  So their Lord cast a glance at them and said: Do you\n\t\t\twish for anything?  They said: What shall we wish for when we\n\t\t\troam freely in Paradise where we please?  And thus did He do to\n\t\t\tthem three times.  When they say that they would not be spared\n\t\t\tfrom being asked [again], they said: O Lord, we would like for\n\t\t\tYou to put back our souls into our bodies so that we might fight\n\t\t\tfor Your sake once again.  And when He saw that they were not in\n\t\t\tneed of anything they were let be.\n\t\t\u003c/p\u003e"
    },
    {
        "BookCode":  "HDQ",
        "HadithNumber":  "28",
        "Body":  "\u003cp\u003e\n\t\t\tThere was amongst those before you a man who had a wound.  He was\n\t\t\tin [such] anguish that he took a knife and made with it a cut in\n\t\t\this hand, and the blood did not cease to flow till he died. \n\t\t\tAllah the Almighty said: My servant has himself forestalled Me; I\n\t\t\t have forbidden him Paradise.\n\t\t\u003c/p\u003e"
    },
    {
        "BookCode":  "HDQ",
        "HadithNumber":  "29",
        "Body":  "\u003cp\u003e\n\t\t\tMy faithful servant\u0027s reward from Me, if I have taken to Me his\n\t\t\tbest friend from amongst the inhabitants of the world and he has\n\t\t\tthen borne it patiently for My sake, shall be nothing less than\n\t\t\tParadise.\n\t\t\u003c/p\u003e"
    },
    {
        "BookCode":  "HDQ",
        "HadithNumber":  "30",
        "Body":  "\u003cp\u003e\n\t\t\tIf My servant likes to meet Me, I like to meet him; and if he\n\t\t\tdislikes to meet Me, I dislike to meet him.  Prophetic\n\t\t\texplanation of this Sacred Hadith: He who likes to meet Allah,\n\t\t\tAllah likes to meet him; and he who dislikes to meet Allah, Allah\n\t\t\tdislikes to meet him.  Aishah (may Allah be pleased with her)\n\t\t\tsaid: O Prophet of Allah, is it because of the dislike of death,\n\t\t\tfor all of us dislike death? The Prophet (pbuh) said: It is not\n\t\t\tso, but rather it is that when the believer is given news of\n\t\t\tAllah\u0027s mercy, His approval and His Paradise, he likes to meet\n\t\t\tAllah and Allah likes to meet him; but when the unbeliever is\n\t\t\tgiven  news of Allah\u0027s punishment and His displeasure, he\n\t\t\tdislikes to meet Allah and Allah dislikes to meet him.\n\t\t\u003c/p\u003e"
    },
    {
        "BookCode":  "HDQ",
        "HadithNumber":  "31",
        "Body":  "\u003cp\u003e\n\t\t\tA man said: By Allah, Allah will not forgive So-and-so.  At this\n\t\t\tAllah the Almighty said: Who is he who swears by Me that I will\n\t\t\tnot forgive So-and-so?\tVerily I have forgiven So-and-so and have\n\t\t\tnullified your [own good] deeds (or as he said [it]).\n\t\t\u003c/p\u003e"
    },
    {
        "BookCode":  "HDQ",
        "HadithNumber":  "32",
        "Body":  "\u003cp\u003e\n\t\t\tA man sinned greatly against himself, and when death came to him\n\t\t\the charged his sons, saying: When I have died, burn me, then\n\t\t\tcrush me and scatter [my ashes] into the sea, for, by Allah, if\n\t\t\tmy Lord takes possession of me, He will punish me in a manner in\n\t\t\twhich He has punished no one [else].  So they  did that to him. \n\t\t\tThen He said to the earth: Produce what you have taken-and there\n\t\t\the was!  And He said to him:  What induced you to do what you\n\t\t\tdid?  He said: Being afraid of You, O my Lord (or he said: Being\n\t\t\tfrightened of You) and because of that He forgave him.\n\t\t\u003c/p\u003e"
    },
    {
        "BookCode":  "HDQ",
        "HadithNumber":  "33",
        "Body":  "\u003cp\u003e\n\t\t\tA servant [of Allah\u0027s] committed a sin and said: O Allah, forgive\n\t\t\tme my sin.  And He (glorified and exalted be He) said: My servant\n\t\t\thas committed a sin and has known that he has a Lord who forgives\n\t\t\tsins and punishes for them.  Then he sinned again and said: O\n\t\t\tLord, forgive me my sin.  And He (glorified and exalted be He)\n\t\t\tsaid: My servant has committed a sin and has known that he has a\n\t\t\tLord who forgives sins and punishes for them.  Then he sinned\n\t\t\tagain and said: O Lord, forgive me my sin.  And He (glorified and\n\t\t\texalted be He) said: My servant has committed a sin and has known\n\t\t\tthat he has a Lord who forgives sins and punishes for sins.  Do\n\t\t\twhat you wish, for I have forgiven you.\n\t\t\u003c/p\u003e"
    },
    {
        "BookCode":  "HDQ",
        "HadithNumber":  "34",
        "Body":  "\u003cp\u003e\n\t\t\tO son of Adam, so long as you call upon Me and ask of Me, I shall\n\t\t\tforgive you for what you have done, and I shall not mind.  O son\n\t\t\tof Adam, were your sins to reach the clouds of the sky and were\n\t\t\tyou then to ask forgiveness of Me, I would forgive you.  O son of\n\t\t\tAdam, were you to come to Me with sins nearly as great as the\n\t\t\tearth and were you then to face Me, ascribing no partner to Me, I\n\t\t\twould bring you forgiveness nearly as great at it.\n\t\t\u003c/p\u003e"
    },
    {
        "BookCode":  "HDQ",
        "HadithNumber":  "35",
        "Body":  "\u003cp\u003e\n\t\t\tOur Lord (glorified and exalted be He) descends each night to the\n\t\t\tearth\u0027s sky when there remains the final third of the night, and\n\t\t\tHe says: Who is saying a prayer to Me that I may answer it?  Who\n\t\t\tis asking something of Me that I may give it him?  Who is asking\n\t\t\tforgiveness of Me that I may forgive him?  And thus He continues\n\t\t\ttill [the light of] dawn shines.\n\t\t\u003c/p\u003e"
    },
    {
        "BookCode":  "HDQ",
        "HadithNumber":  "36",
        "Body":  "\u003cp\u003e\n\t\t\tThe believers will gather together on the Day of Resurrection and\n\t\t\twill say: Should we not ask [someone] to intercede for us with\n\t\t\tour Lord?  So they will come to Adam and will say: You are the\n\t\t\tFather of mankind; Allah created you with His hand He made His\n\t\t\tangels bow down to you and He taught you the names of everything,\n\t\t\tso intercede for us with you Lord so that He may give us relief\n\t\t\tform this place where we are.  And he will say: I am not in a\n\t\t\tposition [to do that] - and he will mention his wrongdoing and\n\t\t\twill feel ashamed and will say: Go to Noah, for he is the first\n\t\t\tmessenger that Allah sent to the inhabitants of the earth.  So\n\t\t\tthey will come to him and he will say: I am not in a position [to\n\t\t\tdo that] - and he will mention his having requested something of\n\t\t\this Lord about which he had no [proper] knowledge (Quran Chapter\n\t\t\t11 Verses 45-46), and he will feel ashamed and will say: Go to\n\t\t\tthe Friend of the Merciful (Abraham).  So they will come to him\n\t\t\tand he will say: I am not in a position  [to do that].\tGo to\n\t\t\tMoses, a servant to whom Allah talked and to whom He gave the\n\t\t\tTorah.\tSo they will come to him and he will say: I am not in a \n\t\t\tposition [to do that] - and he will mention the talking of a life\n\t\t\tother that for a life (Quran Chapter 28 Verses 15-16), and he\n\t\t\twill fell ashamed in the sight of his Lord and will say: Go to\n\t\t\tJesus, Allah\u0027s servant and messenger, Allah\u0027s word and spirit. \n\t\t\tSo they will come to him and he will say: I am not in a position\n\t\t\t[to do that].  Go to Muhammad (may the blessings and peace of\n\t\t\tAllah be upon him), a servant to whom Allah has forgiven all his\n\t\t\twrongdoing, past and future.  So they will come to me and I shall\n\t\t\tset forth to ask permission to come to my Lord, and permission\n\t\t\twill be given, and when I shall see my Lord I shall prostrate\n\t\t\tmyself.  He will leave me thus for such time as it pleases Him,\n\t\t\tand then it will be said [to me]: Raise your head.  Ask and it\n\t\t\twill be granted.  Speak and it will be heard.  Intercede and your\n\t\t\tintercession will be accepted.\tSo I shall raise my head and\n\t\t\tpraise Him with a form of praise that He will teach me.  Then I\n\t\t\tshall intercede and HE will set me a limit [as to the number of\n\t\t\tpeople], so I shall admit them into Paradise.  Then I shall\n\t\t\treturn to Him, and when I shall see my Lord [I shall bow down] as\n\t\t\tbefore.  Then I shall intercede and He will set me a limit [as to\n\t\t\tthe number of people].\tSo I shall admit them into Paradise. \n\t\t\tThen I shall return for a third time, then a fourth, and I shall\n\t\t\tsay: There remains in Hell-fire only those whom the Quran has\n\t\t\tconfined and who must be there for eternity.  There shall come\n\t\t\tout of Hell-fire he who has said: There is no god but Allah and\n\t\t\twho has in his heart goodness weighing a barley-corn; then there\n\t\t\tshall come out of Hell-fire he who has said: There is no god but\n\t\t\tAllah and who has in his heart goodness weighing a grain of\n\t\t\twheat; then there shall come out of Hell-fire he who has said:\n\t\t\tThere is no god but Allah and who has in his heart goodness\n\t\t\tweighing an atom.\n\t\t\u003c/p\u003e"
    },
    {
        "BookCode":  "HDQ",
        "HadithNumber":  "37",
        "Body":  "\u003cp\u003e\n\t\t\tI have prepared for My righteous servants what no eye has seen\n\t\t\tand no ear has heard, not has it occurred to human heart.  Thus\n\t\t\trecite if you wish: And no soul knows what joy for them (the\n\t\t\tinhabitants of Paradise) has been kept hidden (Quran Chapter 32\n\t\t\tVerse 17).\n\t\t\u003c/p\u003e"
    },
    {
        "BookCode":  "HDQ",
        "HadithNumber":  "38",
        "Body":  "\u003cp\u003e\n\t\t\tWhen Allah created Paradise and Hell-fire, He sent Gabriel to\n\t\t\tParadise, saying: Look at it and at what I have prepared therein\n\t\t\tfor its inhabitants.  The Prophet (pbuh) said: So he came to it\n\t\t\tand looked at it and at what Allah had prepared therein for its\n\t\t\tinhabitants.  The Prophet (pbuh) said: So he returned to Him and\n\t\t\tsaid: By your glory, no one hears of it without entering it.  So\n\t\t\tHe ordered that it be encompassed by forms of hardship, and He\n\t\t\tsaid: Return to it and look at what I have prepared therein for\n\t\t\tits inhabitants.  The Prophet (pbuh) said: So he returned to it\n\t\t\tand found that it was encompassed by forms of hardship.  Then he\n\t\t\treturned to Him and said: By Your glory, I fear that no one will\n\t\t\tenter it.  He said: Go to Hell-fire and look at it and what I\n\t\t\thave prepared therein for its inhabitants, and he fount that it\n\t\t\twas in layers, one above the other.  Then he returned to Him and\n\t\t\tsaid: By Your glory, no one who hears of it will enter it.  So He\n\t\t\tordered that it be encompassed by lusts.  Then He said: Return to\n\t\t\tit.  And he returned to it and said: By Your glory, I am\n\t\t\tfrightened that no one will escape from entering it.\n\t\t\u003c/p\u003e"
    },
    {
        "BookCode":  "HDQ",
        "HadithNumber":  "39",
        "Body":  "\u003cp\u003e\n\t\t\tParadise and Hell-fire disputed together, and Hell-fire said: In\n\t\t\tme are the mighty and the haughty.  Paradise said: In me are the\n\t\t\tweak and the poor.  So Allah judged between them, [saying]: You\n\t\t\tare Paradise, My mercy; through you I show mercy to those I wish.\n\t\t\t And you are Hell-fire, My punishment; through you I punish those\n\t\t\tI wish, and it is incumbent upon Me that each of you shall have\n\t\t\tits fill.\n\t\t\u003c/p\u003e"
    },
    {
        "BookCode":  "HDQ",
        "HadithNumber":  "40",
        "Body":  "\u003cp\u003e\n\t\t\tAllah will say to the inhabitant of Paradise: O inhabitants of\n\t\t\tParadise!  They will say: O our Lord, we present ourselves and\n\t\t\tare at Your pleasure, and goodness rests in Your hands.  Then He\n\t\t\twill say: Are you contented? And they will say: And how should we\n\t\t\tnot be contented, O Lord, when You have given to us that which\n\t\t\tYou have given to no one else of Your creation?  Then He will\n\t\t\tsay: Would not like Me to give you something better than that? \n\t\t\tAnd they will say: O Lord and what thing is better than that? And\n\t\t\tHe will say: I shall cause My favour to descend upon you and\n\t\t\tthereafter shall never be displeased with you.\n\t\t\u003c/p\u003e"
    }
]
